{"pillars": {"1": {"id": "1", "name": "User", "description": "Continuously authenticate, access, and monitor user activity patterns to govern users’ access and privileges while protecting and securing all interactions."}, "2": {"id": "2", "name": "Device", "description": "Understanding the health and status of devices informs risk decisions. Real time inspection, assessment, and patching informs every access request."}, "3": {"id": "3", "name": "Application & Workload", "description": "Secure everything from applications to hypervisors, including the protection of containers and virtual machines."}, "4": {"id": "4", "name": "Data", "description": "Data transparency and visibility enabled and secured by enterprise infrastructure, applications, standards, robust end-to-end encryption, and data tagging."}, "5": {"id": "5", "name": "Network & Environment", "description": "Segment, isolate, and control (physically and logically) the network environment with dynamic, granular policy and access controls."}, "6": {"id": "6", "name": "Automation & Orchestration", "description": "Automated security response based on defined processes and security policies enabled by AI (e.g., blocking actions or forcing remediation based on intelligent decisions)."}, "7": {"id": "7", "name": "Visibility & Analytics", "description": "Analyze events, activities, and behaviors to derive context and apply AI/ML to achieve a highly personalized model that improves detection and reaction time in making real-time access decisions."}}, "controls": {"zt-1.1": {"id": "1.1", "name": "User Inventory", "description": "The User Inventory Capability identifies regular and privileged users and denies access by policy to any user not on the authorized user list. To achieve this capability, the organization maintains information about the users in an inventory. Applications, software, and services that have local users (e.g., root and admin users on a device) are considered part of the inventory. Initially, the\n \nuser inventory may be completed manually, with anticipation for an automated process in the future.\nThe capability is initiated during Discovery as a Target activity, serving as a foundation for other capabilities. Initially individual system owners will collect and maintain their own inventories.\nOver time, responsibility will become more centralized, with responsibility elevated to the enclave or DoD Component level. Ultimately DoD will maintain an enterprise-wide user inventory.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.1.1": {"id": "1.1.1", "name": "Inventory User", "description": "DoD will establish a user inventory. The user inventory may initially be the responsibility of the system owner, but the inventory is intended to be organization wide. As the user inventory becomes more centralized, responsibility will shift and be managed at an enclave or enterprise level. This will enable visibility and management of users across all environments to reduce risk of untrusted users with access to resources and removal of users who no longer require access to resources.\no\tThe user inventory may begin as a manual process, with an automated approach planned at a later phase. The objective for the later phase is enhanced automation and integration of disparate user inventory processes and repositories to support management of regular and privileged users across all enterprise systems.", "predecessor": [], "successor": [], "outcomes": ["Identified managed regular users", "Identified managed privileged users", "Identified applications using their own user account management for non- administrative and administrative accounts"], "m": 25.9, "phase": 0}, "zt-1.2": {"id": "1.2", "name": "Conditional User Access", "description": "The Conditional User Access Capability creates a dynamic level of access for users in their environment and denies access to users not known to the system and users who present an unacceptable degree of risk with greater accuracy than currently available. Starting with attribute and role-based access controls across a federated ICAM, the capability will expand to dynamically determine user access. Through a phased implementation, access expands to application focused roles and ultimately uses enterprise attributes to implement dynamic access rules.\nThis capability begins at the Target level and continues into the Advanced level. Much of this capability is implemented at the enterprise-level, with access rules and required attributes defined centrally. Technical solutions, approved at an enterprise level, are implemented in individual systems.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.2.1": {"id": "1.2.1", "name": "Implement Application Based Permissions Per Enterprise", "description": "DoD establishes a basic set of user attributes for authentication and authorization at the enterprise level, collaboratively agreed upon by DoD Components. The Enterprise ILM Activity [User Pillar, Identify Federation and User Credentialing Capability] establishes a standard for these attributes, also agreed to by DoD components. These standards ensure that system owners make use of DoD user authorization attributes to support common user access policies and enable user attribute federation across the Department. During this activity the initial DoD user attribute schema is developed and agreed upon.\no\tThe enterprise ICAM solution is enabled for self-service functionality for adding/updating attributes within the solution.\no\tAny remaining PAM activities are fully migrated to the PAM solution [PAM solution implemented in User Pillar, PAM Capability].", "predecessor": [], "successor": [], "outcomes": ["Enterprise role/attributes needed for user authorization to application functions and/or data have been registered with enterprise ICAM", "DoD Enterprise ICAM has self-service attribute/role registration service that enables application owners to add attributes or use existing enterprise attributes", "Privileged activities are fully migrated to PAM"], "m": 17.7, "phase": 2}, "zt-1.2.2": {"id": "1.2.2", "name": "Rule Based Dynamic Access Part 1", "description": "DoD will implement dynamic privilege management capabilities by using the rules from the Periodic Authentication Activity [User Pillar, Continuous Authorization Capability] to establish basic rules to enable and disable privileges dynamically. These basic rules ensure that access to DAAS is limited to users with appropriate enterprise authentication and authorization attributes. \no\tHigh-risk users who pose a potential risk to the Department will be among the first to have their access privileges determined dynamically.\no\tThe PAM solution will be used to move accounts to dynamic privileged access using JIT and JEA access control methods. JIT and JEA methods grant privileges to controlled resources only for predetermined periods of time on an as-needed basis.", "predecessor": ["1.8.1"], "successor": ["7.6.1", "1.2.3"], "outcomes": ["Access to application’s/service’s functions and/or data are limited to users with appropriate enterprise attributes", "High risk accounts migrated to Just-in-Time/Just Enough Administration (JIT/JEA) methodology in applications/services"], "m": 22.1, "phase": 2}, "zt-1.2.3": {"id": "1.2.3", "name": "Rule Based Access Part 2", "description": "DoD will expand the development of rules for dynamic access decision making by accounting for risk and impact. Due to the criticality of some missions or business functions, a system disconnect, or disablement may need to be completed quickly to eliminate immediate or future remote access to systems", "predecessor": ["4.4.3", "1.2.2"], "successor": [], "outcomes": ["Components and services are fully utilizing rules to enable dynamic access to applications and services", "Technology utilized for Rule Based Dynamic Access supports integration with AI/machine learning (ML) tooling"], "m": 15.5, "phase": 3}, "zt-1.2.4": {"id": "1.2.4", "name": "Enterprise Government Roles and Permissions Part 1", "description": "DoD organizations federate remaining user and group attributes as appropriate to the enterprise ICAM solution. The updated attribute set is used to create DoD-wide roles for organizations to use. DoD will migrate IdP and ICAM core functions to cloud services or environments to improve resilience and performance.", "predecessor": [], "successor": ["1.2.5"], "outcomes": ["Component attribute and role data repository is federated with enterprise ICAM", "Cloud-based enterprise IdP can be used by cloud and on-premises applications", "A standardized set of roles and permissions are created and aligned to attributes"], "m": 11.6, "phase": 3}, "zt-1.2.5": {"id": "1.2.5", "name": "Enterprise Government Roles and Permissions Part 2", "description": "By the end of Phase 4, DoD will have moved all possible IdP and ICAM functions to cloud environments. Denied Degraded Intermittent Limited (DDIL) environments may be able to support disconnected functions but will be managed by centralized ICAM solutions. Updated roles will be mandated for use per defined DoD ICAM governance, with exceptions reviewed following a risk-based approach.", "predecessor": ["1.2.4"], "successor": [], "outcomes": ["Majority of components utilize cloud IdP functionality", "Where possible on-prem IdP is decommissioned", "Permissions and roles are mandated for usage when evaluating attributes"], "m": 11.2, "phase": 4}, "zt-1.3": {"id": "1.3", "name": "Multifactor Authentication", "description": "The MFA Capability will deny access to DAAS and resources unless the user presents multiple forms of authentication. Initially the attention is on developing an organization-focused MFA provider and IdP to enable the centralized management of users. A critical piece to this capability is the retirement and minimization of local or built-in accounts and groups. At the later maturity levels alternative and flexible MFA tokens can be used to provide access for regular and external users. Alternative and flexible MFA tokens will provide for added mission flexibility and cyber resiliency due to support for added MFA tokens. MFA provider(s) move to cloud services instead of being hosted on-premise, when possible. Remaining built-in or shared accounts are managed using a PAM solution following zero trust approaches.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.3.1": {"id": "1.3.1", "name": "Organizational MFA/IdP", "description": "DoD Components procure and implement a centralized IdP and MFA solution, which may be combined in a single application or separated as needed assuming automated integration is supported by both solutions. Both IdP and MFA support integration with the enterprise PKI capability well as enabling key pairs to be signed by the trusted root certificate authorities. Mission/task-critical applications and services use the IdP and MFA solution for management of users and groups.", "predecessor": [], "successor": [], "outcomes": ["Component is using IdP with MFA for critical applications/services", "Components have implemented an IdP that enables DoD public key infrastructure (PKI) MFA", "Organizational standardized PKI for critical services"], "m": 10.56, "phase": 1}, "zt-1.3.2": {"id": "1.3.2", "name": "Alternative Flexible MFA Part 1", "description": "DoD IdP will support alternate methods of MFA complying with cybersecurity requirements (e.g., FIPS 140-3, NIST SP 800-63B, FIPS 201-3 ). Alternative tokens can be used for application-based authentication. Multifactor options support biometric capabilities and can be managed using a selfservice approach. Where possible MFA provider(s) move to cloud services instead of being hosted on-premise.", "predecessor": [], "successor": ["1.3.3"], "outcomes": ["IdP provides user self-service alternative token", "IdP provides alt token MFA for approved applications per policy"], "m": 17.4, "phase": 3}, "zt-1.3.3": {"id": "1.3.3", "name": "Alternative Flexible MFA Part 2", "description": "DoD will use user activity patterns from crosspillar activities such as the Implement UEBA and User Activity Monitoring (UAM) Tooling Activity [User Pillar, Behavioral, Contextual ID, and Biometrics Capability] to assist with access decision making (e.g., not grant access when pattern deviation occurs). This access decision functionality is further extended onto biometric enabled alternative token use.", "predecessor": ["1.3.2"], "successor": [], "outcomes": ["User activity patterns implemented"], "m": 14.6, "phase": 4}, "zt-1.4": {"id": "1.4", "name": "Privileged Access Management", "description": "The PAM Capability secures, controls, monitors, and manages critical assets and applications by limiting administrative access. The capability focuses on the removal of permanent administrator or elevated privileges by implementing PAM solutions and migrating privileged users to it. The capability is expanded by using automation with privilege escalation approvals and feeding analytical results of anomaly detection into the system. DoD Components will procure and implement a PAM solution in Phase 1 of the Target level activities to support all critical privileged use cases. In later phases, DoD Components will integrate PAM with the more challenging applications and services. To support automated approvals and denials of access, DoD will implement behavioral analytics, integrating the analytical results into the PAM solution.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.4.1": {"id": "1.4.1", "name": "Implement System and Migrate Users Part 1", "description": "DoD Components procure and implement a PAM solution in the Organizational MFA/IdP Activity [User Pillar, MFA Capability] to support all critical privileged use cases. Common PAM solutions include MFA for administrators, access manager for storing permissions and privileged user information, password vault for storing secure, privileged accounts, and session-based tracking (logging) once privileged access is granted. \no DoD will identify application/service integration points to determine status of support for the PAM solution. \no Applications/services that easily integrate with the PAM solution are transitioned to the solution.", "predecessor": [], "successor": ["1.4.2"], "outcomes": ["PAM tooling is implemented", "Applications that support and do not support PAM tools are identified.", "Applications that support PAM, now use PAM for controlling emergency/built-in accounts"], "m": 12.4, "phase": 1}, "zt-1.4.2": {"id": "1.4.2", "name": "Implement System and Migrate Users Part 2", "description": "To maximize PAM solution coverage, DoD will integrate PAM with the more challenging applications/services, using the inventory of supported and unsupported applications/services. System owners request exceptions for the applications/services that cannot be integrated into the PAM solution. Exceptions are managed based on risk. Migrate applications/services that cannot be integrated into the PAM solution, off DoD networks, or decommission them", "predecessor": ["1.4.1"], "successor": [], "outcomes": ["Privileged activities are migrated to PAM and access is fully manage"], "m": 14.4, "phase": 2}, "zt-1.4.3": {"id": "1.4.3", "name": "Real Time Approvals and JIT/JEA Analytics Part 1", "description": "DoD will automate the identification of necessary attributes (e.g., users, groups) and integrate the attributes into the PAM solution, only authorizing privileges for users (or processes acting on behalf of users) that are necessary to accomplish assigned organizational tasks. Privileged access requests are migrated to the PAM solution for automated approvals and denials.", "predecessor": [], "successor": ["1.4.4"], "outcomes": ["Accounts, applications, and data of concern (of greatest risk to DoD mission) are identified", "All privileged access to applications/services follows JIT/JEA methodology", "Privileged access requests are automated as appropriate"], "m": 12.5, "phase": 3}, "zt-1.4.4": {"id": "1.4.4", "name": "Real Time Approvals and JIT/JEA Analytics Part 2", "description": "DoD components will integrate UEBA and UAM solutions with the PAM solutions providing user pattern analytics to support access decision making.", "predecessor": ["1.4.3"], "successor": [], "outcomes": ["UEBA or similar analytic system is integrated with PAM tools for JIT/JEA account approvals"], "m": 8.9, "phase": 4}, "zt-1.5": {"id": "1.5", "name": "Identity Federation and User Credentialing", "description": "The Identity Federation and User Credentialing Capability increases visibility and accuracy of user authentication information, to include DoD users and users managed by other agencies. Users lacking sufficient credentials or privileges are denied access according to established policies. Initially the capability focuses on standardizing the ILM processes and integrating with the organizational IdP/identity and access management (IAM) solutions. Once completed, the capability shifts to establishing an enterprise ILM process/solution either through a single solution or identity federation. In later phases, the integrated ILM processes will enable enterprise automation and analytics.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.5.1": {"id": "1.5.1", "name": "Organizational ILM", "description": "DoD Components establish an ILM process for regular and privileged users, defining processes for when users join, transfer, or leave the organization. Using the organizational IdP, DoD Components implement the ILM process. All users are migrated to the ILM process, except for a minimal number of exceptions. Users who are outside of the standard ILM process are approved through risk-based exceptions and are regularly evaluated for decommissioning. An example of an exception-based user is built-in users for a piece of equipment from a vendor that cannot be managed through the standard ILM process.", "predecessor": [], "successor": ["1.5.2"], "outcomes": ["Standardized identity lifecycle process"], "m": 14.8, "phase": 1}, "zt-1.5.2": {"id": "1.5.2", "name": "Enterprise ILM Part 1", "description": "DoD and the DoD Components will review and align the Component’s ILM processes, policies, and standards and agree upon a common policy and supporting ILM processes to implement across DoD. Using the centralized or federated IDP and ICAM solutions, DoD Components implement the enterprise ILM process for the greatest number of identities, groups, and permissions. Any exceptions to this policy are managed using a risk-based approach.", "predecessor": ["1.5.1"], "successor": ["1.5.3"], "outcomes": ["Automated identity lifecycle processes", "Integrated with Enterprise ICAM process and tools"], "m": 11.7, "phase": 2}, "zt-1.5.3": {"id": "1.5.3", "name": "Enterprise ILM Part 2", "description": "DoD Components will integrate selected critical automation functions (i.e., functions that manage identities, accounts, and permissions) into the IdP and ICAM solutions to enable enterprise automation and analytics. The primary ILM processes are integrated into the cloud-based enterprise ICAM solution.", "predecessor": ["1.5.2"], "successor": ["1.5.4"], "outcomes": ["Integration with critical IDM63/IdP functions", "Primary ILM functions are cloud based"], "m": 12.8, "phase": 3}, "zt-1.5.4": {"id": "1.5.4", "name": "Enterprise ILM Part 3", "description": "DoD Components will further integrate critical IdP and ICAM automated functions into the enterprise ILM process to enable additional enterprise automation and analytics. The primary ILM processes are integrated into the cloud-based enterprise ICAM solution. The objective is direct and efficient integration of Enterprise user identities, accounts, and authorization attributes with access control mechanisms, including future support for risk-based access control.", "predecessor": ["1.5.3"], "successor": [], "outcomes": ["All ILM functions moved to cloud as appropriate", "Integration with all IDM/IdP functions"], "m": 9.2, "phase": 4}, "zt-1.6": {"id": "1.6", "name": "Behavioral, Contextual ID, and Biometrics", "description": "The Behavioral, Contextual ID, and Biometrics Capability enhances authentication to provide a more accurate picture of risk. Initially using the enterprise IdP, the capability enables UEBA with basic user attributes. This is expanded into organization-specific attributes using organizational IdPs as available. Over time, UEBA is integrated with the PAM and JIT/JEA solutions, with a goal to integrate monitoring with all services and to better detect anomalous and malicious activities. Data collected during the monitoring process should inform access decisions.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.6.1": {"id": "1.6.1", "name": "Implement UEBA and UAM Tooling", "description": "DoD Components procure and implement UEBA and UAM solutions, integrating with the enterprise IdP. Initially UEBA implements basic user attributes such as contextual (e.g., device location, device posture, time of day) attributes and traditional (e.g., organizational role, user id, group memberships) attributes. These attributes are analyzed over time to indicate unusual or deviations of values, resulting in a decision on the trustworthiness of an identity. If the identity is not trustworthy, the authentication by the IdP should fail.", "predecessor": [], "successor": ["7.3.2", "7.2.5", "7.4.1"], "outcomes": ["UEBA and UAM functionality are implemented for the enterprise IdP"], "m": 15.9, "phase": 2}, "zt-1.6.2": {"id": "1.6.2", "name": "User Activity Monitoring Part 1", "description": "DoD Components integrate UEBA and UAM solutions with organizational IdPs for extended visibility as needed. Analytics and data generated by UEBA and UAM for organizationally defined mission critical applications/services are integrated with the JIT/JEA solution further improving decision making.", "predecessor": ["7.2.5"], "successor": ["1.6.3"], "outcomes": ["UEBA is integrated with organizational IdPs as appropriate", "UEBA is integrated with JIT/JEA for critical services"], "m": 13.5, "phase": 3}, "zt-1.6.3": {"id": "1.6.3", "name": "User Activity Monitoring Part 2", "description": "DoD Components continue using analytics from UEBA and UAM solutions by using data generated from all monitored applications and services when decision making occurs in the JIT/JEA solution. These solutions will enable DoD components to detect and respond to types of insider threats, such as events or attacks by negligent, malicious, and compromised users more efficiently.", "predecessor": ["1.6.2"], "successor": ["5.2.5", "3.4.3"], "outcomes": ["UEBA is integrated with JIT/JEA for all services"], "m": 11.2, "phase": 4}, "zt-1.7": {"id": "1.7", "name": "Least Privileged Access", "description": "The Least Privileged Access Capability grants and denies users’ access to only the DAAS for which they are authorized and authenticated over a specific timeframe. The capability establishes governance processes to limit access to DAAS to the absolute minimum access required to perform routine, legitimate tasks, or activities. Various techniques are used at different organizational levels to limit access to DAAS. For this capability, DoD application owners identify the necessary roles and attributes for standard and privileged user access. Privileged access for all DoD organizational DAAS is audited and removed when unneeded.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.7.1": {"id": "1.7.1", "name": "Deny User by Default Policy", "description": "DoD Components audit internal user and group usage for permissions and revoke permissions when possible. This activity includes the revocation and/or decommission of excess permissions and access for application/service-based identities and groups. Where possible static privileged users are decommissioned or reduced permissions are prepared for future rule/dynamic based access.", "predecessor": [], "successor": [], "outcomes": ["Applications are updated to deny by default to functions/data requiring specificroles/attributes for access.", "Reduced default permissions levels are implemented.", "Applications/services have been reviewed/audited to identify all privileged usersand removed those users who do not need that level of access.", "Application functions and data requiring specific roles/attributes for access havebeen identified."], "m": 22.7, "phase": 1}, "zt-1.8": {"id": "1.8", "name": "Continuous Authentication", "description": "The Continuous Authentication Capability requires users and NPEs to provide additional authentication based on access requested and risk posture along with basic rules. Implementing this capability methodically moves DoD towards continuous attribute-based authentication. Initially the capability focuses on standardizing legacy single authentication to an organizationally approved IdP with users and groups. The second stage adds in rule based (time) authentication and matures to continuous authentication based on the application/software activities and privileges requested.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.8.1": {"id": "1.8.1", "name": "Single Authentication", "description": "DoD organizations employ basic authentication processes to authenticate users and NPEs at least once per session (e.g., logon). Users being authenticated are managed by the parallel Activity 1.3.1 Organizational MFA/IdP [User Pillar, MFA Capability], with the organizational IdP instead of using application/servicebased identities and groups.", "predecessor": [], "successor": ["3.4.1", "3.4.6", "1.2.2"], "outcomes": ["Authentication implemented across applications per session"], "m": 19.2, "phase": 1}, "zt-1.8.2": {"id": "1.8.2", "name": "Periodic Authentication", "description": "DoD organizations enable periodic authentication requirements for applications and services. Periodic authentication is supported based on a defined and configurable time value during a user’s session, including activation following a period of user inactivity.", "predecessor": [], "successor": ["7.6.1", "1.8.3"], "outcomes": ["Authentication implemented multiple times per session based on security attributes"], "m": 25.39, "phase": 2}, "zt-1.8.3": {"id": "1.8.3", "name": "Continuous Authentication Part 1", "description": "DoD organizations’ applications/service use multiple session authentications based on security attributes and access requested. Privilege changes and associational transaction requests required additional levels of authentication such as MFA pushes to users.", "predecessor": ["1.8.2"], "successor": ["1.8.4"], "outcomes": ["Transaction authentication implemented based on security attributes"], "m": 16.8, "phase": 3}, "zt-1.8.4": {"id": "1.8.4", "name": "Continuous Authentication Part 2", "description": "DoD organizations continue the use of transaction-based authentication to include integration of methodologies such as user patterns. The objective is adaptive or risk-based authentication based on a rich set of data and intelligence so that the authentication method is appropriately matched to context and risks.", "predecessor": ["1.8.3"], "successor": ["5.2.5", "7.6.2"], "outcomes": ["Transaction authentication implemented based on security attributes"], "m": 16.8, "phase": 4}, "zt-1.9": {"id": "1.9", "name": "Integrated ICAM Platform", "description": "The Integrated ICAM Platform Capability centrally manages identities and key pairs of users and NPE to ensure authorized and authenticated access to DAAS resources across platforms. The capability allows organizations to verify the need and right to access via credential management systems, identity governance and administration tools, and an access management tool. The DoD Enterprise and Components employs enterprise-level identity management through identity provider(s) and PKI systems to track user, administrator, and NPE identities across the network and ensure access is limited to only those who have the need and the right to know. PKI systems can be federated but must either trust a central root certificate authority (CA) or cross-sign standardized organizational CAs conforming to Federal Bridge70 standards. Organizations’ IdPs and PKI CAs are integrated with the enterprise IdP and PKI solutions. Biometric functionality is moved from organizational solutions to the enterprise enabling biometric support for mission/task-critical applications and services as appropriate.", "predecessor": [], "successor": [], "outcomes": []}, "zt-1.9.1": {"id": "1.9.1", "name": "Enterprise PKI/IdP Part 1", "description": "DoD Enterprise works with organizations to implement a centralized or federated enterprise PKI and IdP solutions. The enterprise PKI solution uses a single or set of enterprise level root CAs, which are trusted by organizations to build intermediate CAs. The IdP solution may either be a single solution or federated set of organizational IdPs with a standard level of access across organizations and standardized set of attributes. Organizations’ IdPs and PKI CAs are integrated with the enterprise IdP and PKI solutions.", "predecessor": [], "successor": ["1.9.2"], "outcomes": ["Components are using IdP with MFA for all applications/services", "Organizational MFA/PKI integrated with enterprise MFA/PKI", "Organizational standardized PKI for all services"], "m": 12.4, "phase": 2}, "zt-1.9.2": {"id": "1.9.2", "name": "Enterprise PKI/IdP Part 2", "description": "DoD organizations enable biometric support in the IdP for mission/task-critical applications and services as appropriate. Biometric functionality is moved from organizational solutions to the enterprise. Organizational MFA and PKI are decommissioned and migrated to the enterprise as appropriate.", "predecessor": ["1.9.1"], "successor": ["1.9.3"], "outcomes": ["Critical organizational services integrated with biometrics", "Decommission organizational MFA/PKI as appropriate in lieu of enterprise MFA/PKI", "Enterprise biometric functions implemented"], "m": 27.2, "phase": 3}, "zt-1.9.3": {"id": "1.9.3", "name": "Enterprise PKI/IdP Part 3", "description": "DoD organizations integrate the remaining applications/services with biometrics functionalities. Alternative MFA tokens can be used.", "predecessor": ["1.9.2"], "successor": [], "outcomes": ["All organizational services integrate with biometrics"], "m": 30.0, "phase": 4}, "zt-2.1": {"id": "2.1", "name": "Device Inventory", "description": "The Device Inventory Capability limits network access to devices that are known, authorized, and listed in the device inventory. By policy, all other devices will be denied network access. DoD Components will establish and maintain an approved inventory of all devices authorized to access the network and enroll all devices on the network prior to network connection. Device attributes will include technical details such as the PKI machine certificate (e.g., used for 802.1x authentication), device object, patch/vulnerability status and other attributes to enable later access control decision activities. This capability is initiated as a Target activity during the Discovery Phase with the development of a device inventory, including a survey of tools to assess the health of the devices. Once a manual inventory is created the focus shifts to centralized and automated management of devices and NPEs using PKI and attribute management in the enterprise IdP. Device management is automated and standardized ensuring that device and NPE attributes are consistent and regularly updated. In the later stages of this capability devices and NPEs are centrally managed via the enterprise IdP and contextual attributes are added. These additional attributes focus on providing more context to the risk posture of a device or NPE, better informing the PDP to make access decisions.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.1.1": {"id": "2.1.1", "name": "Device Health Tool Gap Analysis", "description": "DoD Components inventory all devices within their environment to understand what type of devices (e.g., laptops, desktops, Internet of Things (IoT), Mobile, OT) exist in the environment and how they are being managed, if at all. \no The inventory establishes a baseline of known and managed devices and NPEs for the Device Pillar. \no Devices and NPE are managed through the Enterprise Device Management Activity [Device Pillar, Unified Endpoint Management and Mobile Device Management Capability] and integrated with the enterprise IdP and PKI providers. \no Initially, this is a manual inventory but as the process matures, the inventory process will be automated. \no Device attributes, defined at the DoD enterprise level, tracked in the inventory will be sufficient to enable DoD Target Level functionality. \nThe inventory is also used to identify existing tools that can assess device health information among the device types addressed in this overlay (e.g., laptops, servers, virtual machines, mobile). \no DoD will conduct a gap analysis to determine if any additional tools are needed to assess device health. D-14 \no Device health includes gathering the device status (e.g., configuration settings, installed/operating security software, patch status, and signature status). \no Accurate device health information is critical when making device access decisions. \no If system owners have unique devices, they may be expected to participate in the health tool gap analysis to represent their unique needs.", "predecessor": [], "successor": [], "outcomes": ["Manual inventory of devices is created per organization with owners"], "m": 9.8, "phase": 0}, "zt-2.1.2": {"id": "2.1.2", "name": "NPE/PKI, Device Under Management", "description": "DoD organizations use the DoD enterprise PKI solution/service to deploy X.509 certificates to all supported and managed devices. Other NPEs that support X.509 certificates are included in the PKI or IdP systems. \no PKI is used to provide unique identification (i.e., public/private keypairs) to devices and NPEs and can also be used to authenticate and authorize access in conjunction with a PEP.", "predecessor": ["2.6.2"], "successor": ["2.4.1", "2.3.6", "2.2.1"], "outcomes": ["NPE are managed via organizational PKI and organizational IdP"], "m": 22.8, "phase": 1}, "zt-2.1.3": {"id": "2.1.3", "name": "Enterprise IdP Part 1", "description": "DoD’s enterprise IdP uses centralized technology or federated organizational technologies to integrate devices and NPEs (e.g., service accounts) and uses the Enterprise Device Management solution to track the integration. If NPEs cannot be integrated with the IdP, they are either marked for retirement or accepted using a risk-based approach.", "predecessor": [], "successor": ["4.7.4", "2.1.4"], "outcomes": ["NPEs including devices are integrated with enterprise IdP"], "m": 12.8, "phase": 2}, "zt-2.1.4": {"id": "2.1.4", "name": "Enterprise IdP Part 2", "description": "The DoD Enterprise IdP using a centralized technology or federated organizational technologies adds additional dynamic attributes for NPEs such as location, usage patterns, etc.", "predecessor": ["2.1.3"], "successor": [], "outcomes": ["Conditional device attributes are part of the IdP profile"], "m": 8.8, "phase": 3}, "zt-2.2": {"id": "2.2", "name": "Device Detection and Compliance", "description": "The Device Detection and Compliance Capability detects any device attempting to connect to the network, only allowing compliant devices (e.g., anti-virus is up to date, approved configuration) access to requested DAAS. DoD organizations employ asset management systems for user devices to maintain and report on information technology and cybersecurity compliance. Managed devices (enterprise and mobile) attempting to connect to a DoD network or access a DAAS resource will be detected and be measured for compliance (via C2C). DoD and the Components initiate this Target level capability in Phase 2. DoD Enterprise and the Components implementing the C2C solution after it has been procured. DoD expands the use of C2C to meet advanced zero trust functionality needs and integrates the solution(s) with the enterprise IdP and Authorization Gateways.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.2.1": {"id": "2.2.1", "name": "Implement C2C/Compliance Based Network Authorization Part 1", "description": "DoD Enterprise, working with the Components, will develop policy, standards, and requirements for C2C. \no Once agreement is reached, solution procurement is started, and a vendor(s) is selected. D-22 \no Implementation begins in low risk zero trust target environments with base level functionality. \no Base level checks are implemented in the new C2C solution enabling the ability to meet zero trust architecture target functionalities.", "predecessor": ["2.1.2", "2.4.2", "2.5.1"], "successor": ["2.2.2"], "outcomes": ["C2C rollout starts at the enterprise level for low risk and testing environments", "Basic device checks are implemented using C2C"], "m": 9.4, "phase": 2}, "zt-2.2.2": {"id": "2.2.2", "name": "Implement C2C/Compliance Based Network Authorization Part 2", "description": "DoD Components expand use of C2C to all supported environments required to meet zero trust advanced functionalities. C2C teams integrate their solution(s) with the enterprise IdP, Authorization Gateways, and PEPs to better manage access and authorizations to resources.", "predecessor": ["2.3.5", "2.2.1"], "successor": ["5.2.5"], "outcomes": ["C2C is rolled out to all supported environments", "Advanced device checks are completed and integrated with dynamic access (enterprise IdP/zero trust network access (ZTNA))"], "m": 18.2, "phase": 3}, "zt-2.3": {"id": "2.3", "name": "Device Authorization with Real Time Inspection", "description": "The Device Authorization with Real Time Inspection Capability defines policies to deny devices by default and explicitly allow access to DAAS resources only by devices that meet mandated configuration standards. To better understand the risk posture, DoD integrates foundational and extended tool (e.g., NGAV, Application Control, File Integrity Monitoring (FIM), etc.) capabilities into C2C. The tools provide additional information about device hygiene, which informs the risk posture and allows more granular access decisions. Organizational PKI systems are integrated to expand the existing enterprise PKI to devices. Entity Activity Monitoring is integrated to identify anomalous activities. Security threats identified are remediated faster through continuous activity inspection. This Target level Capability begins during Discovery with the procurement of NGAV and AntiMalware solutions, which are integrated with the initial deployment of C2C. The NGAV solutions are implemented on all critical services and applications. For additional capability, DoD procures and implements FIM and Application Control solutions. Additional tools and solutions are integrated into C2C to expand device attributes and improve access decisions.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.3.1": {"id": "2.3.1", "name": "Entity Activity Monitoring Part 1", "description": "Baselines of normal user and device behavior are developed and integrated with the UEBA solution. The UEBA solution informs device authorization decisions using the integrated baselines and the device attributes.", "predecessor": ["7.2.5"], "successor": ["2.3.2"], "outcomes": ["User and Entity Behavioral Activity (UEBA) attributes are integrated for device baselining", "UEBA attributes are available for usage with device access"], "m": 16.4, "phase": 3}, "zt-2.3.2": {"id": "2.3.2", "name": "Entity Activity Monitoring Part 2", "description": "The DoD Components use the UEBA solution with network access solutions to mandate UEBA attributes (e.g., device health, logon patterns, etc.) for accessing environments and resources.", "predecessor": ["2.3.1"], "successor": ["5.2.5", "3.4.3"], "outcomes": ["UEBA attributes are mandated for device access"], "m": 16.7, "phase": 4}, "zt-2.3.3": {"id": "2.3.3", "name": "Implement Application Control and FIM Tools", "description": "DoD Components procure and implement FIM and Application Control solutions. \no FIM continues development and expands monitoring in the Data Pillar. D-33 \no Application Control is deployed to low-risk environments in a monitor only mode establishing baseline allowances. \no Application control teams begin integration with the enterprise and organization PKI environments to use certificates for application allowances. \no NextGen AV (started in the Discovery Phase/Target Level, in the Integrate NextGen AV Tools with C2C Activity [Device Pillar, Device Authorization with Real Time Inspection Capability]) is expanded to cover all possible services and applications.", "predecessor": [], "successor": [], "outcomes": ["Application Control and FIM tooling is implemented on all critical services/applications", "Application Control and FIM data is sent to C2C as needed", "NextGen AV tooling covers maximum amount of services/applications"], "m": 16.2, "phase": 2}, "zt-2.3.4": {"id": "2.3.4", "name": "Integrate NextGen AV Tools with C2C", "description": "DoD Components procure and implement NGAV and Anti-Malware solutions as needed and integrate those solutions with the initial deployment of C2C to check baseline status (e.g., signatures, updates, etc.).", "predecessor": [], "successor": ["2.2.1", "2.7.1"], "outcomes": ["Critical NextGen AV data is being sent to C2C for checks", "NextGen AV tooling is implemented on all critical services/applications"], "m": 18.5, "phase": 0}, "zt-2.3.5": {"id": "2.3.5", "name": "Fully Integrate Device Security Stack with C2C as Appropriate", "description": "DoD Components continue to deploy Application Control to all environments and expands from alert mode into prevention mode. FIM and Application Control analytics are integrated into C2C for expanded access decision making data points. C2C analytics are evaluated for further device/endpoint security stack data points such as unified endpoint management (UEM) and are integrated as necessary.", "predecessor": [], "successor": ["2.2.2", "2.4.4"], "outcomes": ["Application Control and FIM deployment is expanded to all necessary services/applications", "Remaining data from device security tooling is implemented with C2C"], "m": 13.3, "phase": 3}, "zt-2.3.6": {"id": "2.3.6", "name": "Enterprise PKI Part 1", "description": "The DoD enterprise PKI will be expanded to include the addition of NPE and device certificates. NPEs and devices that do not support PKI certificates will be marked for retirement and decommissioned. Additional ILM processes are integrated into the cloud-based enterprise ICAM solution.", "predecessor": ["2.1.2", "2.6.1"], "successor": ["2.3.7"], "outcomes": ["Devices that are unable to have certificates are phased out and/or moved to minimal access environments", "All devices and NPEs have certs installed for authentication in the Enterprise PKI"], "m": 22.7, "phase": 3}, "zt-2.3.7": {"id": "2.3.7", "name": "Enterprise PKI Part 2", "description": "DoD Components use certificates for device authentication and machine to machine communications. Unsupported devices are retired, and exceptions are approved using a risk-based approach.", "predecessor": ["2.3.6"], "successor": [], "outcomes": ["Devices are required to authenticate to communicate with other services and devices"], "m": 10.5, "phase": 4}, "zt-2.4": {"id": "2.4", "name": "Remote Access", "description": "The Remote Access Capability enables authenticated devices to access DAAS from remote locations following a risk-based approach. DoD Components identify, audit, and assess tools used to authenticate devices and grant access, eliminating access methods where possible. For the remaining tools, limit access to the tools to control permission creep and establish a least privilege baseline for tool access. In Phase 2 this access is expanded to cover basic BYOD and IoT support using the enterprise IdP for approved applications. The final phases expand coverage to include all BYOD and IoT devices for services using the approved set of device attributes. The capability is initiated in Phase 1 by blocking all unmanaged remote access to DAAS, allowing only compliant managed devices access based on risk, automating mechanisms to monitor and control remote access methods. Starting in the later Target phase (Phase 2), BYOD and IoT devices are managed and integrated into the enterprise IdP. As zero trust continues to mature, BYOD and IoT are further integrated into the architecture by using more advanced methods of access control (e.g., dynamic permissions).", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.4.1": {"id": "2.4.1", "name": "Deny Device by Default Policy", "description": "DoD Components block all unmanaged remote and local device access to resources. Compliant managed devices are provided access based on risk following ZTA target level concepts.", "predecessor": ["2.1.2"], "successor": [], "outcomes": ["Components can block device access by default to resources (apps/data) and explicitly allow compliant devices per policy", "Remote Access is enabled following a \"deny device by default policy\" approach"], "m": 9.6, "phase": 1}, "zt-2.4.2": {"id": "2.4.2", "name": "Managed and Limited BYOD and IOT Support", "description": "DoD Components use UEM and similar solutions to ensure that managed BYOD and IoT devices are fully integrated with enterprise IdP to support user and device-based authorization. Device access for all applications requires dynamic access policies.", "predecessor": [], "successor": ["2.2.1", "2.4.3"], "outcomes": ["All applications require dynamic permission access for devices", "BYOD and IoT device permissions are baselined and integrated with enterprise IdP"], "m": 39.7, "phase": 2}, "zt-2.4.3": {"id": "2.4.3", "name": "Managed and Full BYOD and IOT Support Part 1", "description": null, "predecessor": ["2.4.2"], "successor": ["2.4.4"], "outcomes": ["Only BYOD and IoT devices that meet mandated configuration standards allowed to access resources", "Critical Services require dynamic access for devices"], "m": 24.7, "phase": 3}, "zt-2.4.4": {"id": "2.4.4", "name": "Managed and Full BYOD and IOT Support Part 2", "description": "DoD Components use UEM and similar solutions to enable access for unmanaged devices meeting device checks and standard baselines. All possible services/applications are integrated to allow access by managed devices per defined authorization policies. Unmanaged devices are integrated with services/applications based on a risk driven authorization approach.", "predecessor": ["2.3.5", "2.4.3"], "successor": [], "outcomes": ["All possible services require dynamic access for devices"], "m": 24.6, "phase": 4}, "zt-2.5": {"id": "2.5", "name": "Partially and Fully Automated Asset, Vulnerability, and Patch Management", "description": "The Partially and Fully Automated Asset, Vulnerability, and Patch Management Capability automatically deploys vendor patches to all in scope devices. DoD Components establish processes to automate the testing and deployment of vendor patches for connected devices or employ a hybrid patch management approach (with both human and automated components). This capability is initiated in Phase 1as a target level activity. DoD implements configuration management solutions to manage asset/device configurations (e.g., STIGs), vulnerabilities, and patches that reflect the most restrictive mode consistent with operational requirements. Flaw remediation is incorporated into configuration management processes and automatically tests and deploys patches mitigating risks. DoD continuously monitors and scans for vulnerabilities in their systems and hosted applications.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.5.1": {"id": "2.5.1", "name": "Implement Asset, Vulnerability, and Patch Management Tools", "description": "DoD Components implement solution(s) for managing assets/devices configurations, vulnerabilities, and patches. As part of the procurement and implementation process for solutions, APIs or other programmatic interfaces will be in scope for future levels of automation and integration.", "predecessor": [], "successor": ["2.2.1", "3.2.3"], "outcomes": ["Components can confirm if devices meet minimum compliance standards or not", "Components have asset management, vulnerability, and patching systems with APIs that will enable integration across systems"], "m": 18.4, "phase": 1}, "zt-2.6": {"id": "2.6", "name": "Unified Endpoint Management and Mobile Device Management", "description": "The UEM and mobile device management (MDM) Capability establishes a centralized UEM solution that provides the choice of agent or agentless management of computer and mobile devices using a single console regardless of device location. DoD-issued devices can be remotely managed and security policies are enforced. DoD Components, using the enterprise console, can manage, secure, and deploy resources and applications on any device and provide redress of cybersecurity threats. Security vulnerabilities are mitigated, and policy enforcement measures are received through remote management of DoD-issued mobile devices. The UEM and MDM Capability begins in Phase 1 with the definition of attributes needed to support mission and business functions. To procure a UEM or equivalent solution that can integrate with other zero trust solutions, various activity teams collaborate to define a common set of requirements and procure solutions that work together. As processes mature, DoD migrates their remaining devices to the UEM or equivalent solution and integrates the UEM with risk and compliance solutions as appropriate.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.6.1": {"id": "2.6.1", "name": "Implement UEM or Equivalent Tools", "description": "DoD Components will collaborate with the team implementing Activity 2.5.1, Implement Asset, Vulnerability, and Patch Management Tools [Device Pillar, Partially and Fully Automated Asset, Vulnerability, and Patch Management] to procure and implement a UEM solution that ensures requirements are integrated with the procurement process. Once a solution is procured, the UEM team(s) ensure that critical zero trust target functionalities such as minimum compliance, asset management, and API support are in place.", "predecessor": [], "successor": ["2.3.6"], "outcomes": ["Components can confirm if devices meet minimum compliance standards or not", "Components have asset management system(s) for user devices (phones, desktops, laptops) that maintains IT compliance, which is reported up to DoD enterprise", "Components asset management systems can programmatically (i.e., API) provide device compliance status and if it meets minimum standards"], "m": 18.1, "phase": 1}, "zt-2.6.2": {"id": "2.6.2", "name": "Enterprise Device Management Part 1", "description": "DoD Components migrate the manual device inventory to an automated process using the UEM solution. Approved devices can be managed regardless of location (i.e., on or off the DoDIN).", "predecessor": [], "successor": ["2.1.2", "2.6.3"], "outcomes": ["Manual inventory is integrated with an automated management solution for critical services", "Enable ZT device management (from any location with or without remote access)"], "m": 17.6, "phase": 1}, "zt-2.6.3": {"id": "2.6.3", "name": "Enterprise Device Management Part 2", "description": "DoD Components migrate remaining devices to the UEM solution and integrate with risk and compliance solutions as appropriate. The objective is enterprise visibility, management, and enhanced security of all types of DoD devices.", "predecessor": ["2.6.2"], "successor": [], "outcomes": ["Manual inventory is integrated with an automated management solution for all services"], "m": 12.6, "phase": 2}, "zt-2.7": {"id": "2.7", "name": "Endpoint and Extended Detection and Response", "description": "The Endpoint Detection and Response (EDR) and Extended Detection and Response (XDR) Capability monitors, detects, and remediates malicious activity on endpoints. Initially threats originating from network-connected endpoints are reduced through active investigation and response. Expanding the capability to include XDR tooling allows organizations to account for activity beyond the endpoints such as cloud and network. As the processes mature, correlating data across multiple security layers (e.g., email, cloud, endpoint) enables forensics, faster threat detection, and remediation. The EDR & XDR Capability reduces threats from networkconnected endpoints through active and automated investigation and response.", "predecessor": [], "successor": [], "outcomes": []}, "zt-2.7.1": {"id": "2.7.1", "name": "Implement EDR & XDR Tools and Integrate with C2C", "description": "DoD Components procure and implement EDR solution(s) within selected environments (e.g., enclaves, systems, operating environments). EDR protects, monitors, and responds to malicious and anomalous activities enabling zero trust target functionality and sends data to the C2C solution for expanded device and user checks. Successful EDR implementation results in host-based monitoring mechanisms used to collect information about the host (or system in which it resides).", "predecessor": ["2.3.4"], "successor": ["2.7.2"], "outcomes": ["EDR tooling is implemented", "Critical EDR data is being sent to C2C for checks", "NextGen AV tooling covers maximum amount of services/applications"], "m": 16.5, "phase": 1}, "zt-2.7.2": {"id": "2.7.2", "name": "Implement XDR Tools and Integrate with C2C Part 1", "description": "To extend monitoring functionality, connected DoD Components procure and implement XDR solution(s), connecting and configuring individual detection and response tools into a system-wide detection and response system. Integration points with cross pillar capabilities are identified and prioritized based on risk. The riskiest of these integration points are identified and integration is started. EDR continues coverage of endpoints to include the maximum number of services and applications as part of the XDR implementation. Basic analytic results are sent from the XDR solution stack to the SIEM. Linking individual intrusion detection tools into a system-wide intrusion detection system provides additional coverage and effective detection capabilities. The information contained in one intrusion detection tool can be shared widely across the organization, making the system-wide detection capability more robust and powerful.", "predecessor": ["2.7.1", "7.2.1"], "successor": ["2.7.3"], "outcomes": ["Integration points have been identified per capability", "EDR tooling covers maximum amount of services/applications", "Riskiest integration points have been integrated with XDR", "Basic alerting is in place with SIEM and/or other mechanisms"], "m": 19.22, "phase": 2}, "zt-2.7.3": {"id": "2.7.3", "name": "Implement XDR Tools and Integrate with C2C Part 2", "description": "Expand XDR coverage to the fullest possible amount by completing the identification of XDR integration points. Track and manage exceptions using a risk-based approach for continued operation. Integrate extended analytics into the SIEM and other appropriate solutions to enable zero trust advanced functionalities.", "predecessor": ["2.7.2"], "successor": ["7.2.3"], "outcomes": ["Remaining integration points have been integrated as appropriate", "Extended alerting and response are enabled with other analytics tools at leastusing SIEM"], "m": 19.94, "phase": 3}, "zt-3.1": {"id": "3.1", "name": "Application Inventory", "description": "The Application Inventory Capability requires system owners to identify and inventory applications and ensure they have been authorized for use prior to connecting to DoD networks. These actions prevent unauthorized applications and application components from being used on or within a system, limiting risk exposure. This Capability takes place in the Discovery Phase and focuses on the creation of an application and code inventory, which includes the type of object (e.g., source code, script, library), supported status (e.g., active, legacy), and hosted/used location (e.g., on-premise, cloud, hybrid). Once completed the inventory is managed in Activity 3.3.1, Approved Binaries/Code [Application & Workload Pillar, Software Risk Management Capability].", "predecessor": [], "successor": [], "outcomes": []}, "zt-3.1.1": {"id": "3.1.1", "name": "Application/Code Identification", "description": "DoD Components create an inventory of approved applications and code (e.g., source code, libraries, etc.). Each system owner is responsible for tracking applications and application components in the inventory. The inventory includes supportability (e.g., active, legacy, etc.) and hosted location (e.g., cloud, on-premise, hybrid, etc.) at a minimum.", "predecessor": [], "successor": [], "outcomes": ["Component has identified applications and classified as either legacy, virtualized on-premises, and cloud hosted"], "m": 16.7, "phase": 0}, "zt-3.2": {"id": "3.2", "name": "Secure Software Development & Integration", "description": "The Secure Software Development & Integration Capability ensures zero trust application and software security concepts, processes, and capabilities are integrated within the DevSecOps environment. The capability includes static and dynamic application security testing, necessary for the discovery of weaknesses and vulnerabilities during application development. Foundational software and application security processes and infrastructure are established following zero trust principles and best practices. Controls such as code review, runtime protection, secure API gateways, container and serverless security are integrated and automated. The capability focuses on the development of basic software factory functionality and the associated application security activities. The foundational DevSecOps methodology and CI/CD pipeline(s) are established with more advanced processes such as continuous authorization to operate (cATO) integrated as an advanced capability. Application security initially focuses on integration with patch and vulnerability management tools. As the capability matures, application security expands functionality to remediation automation.", "predecessor": [], "successor": [], "outcomes": []}, "zt-3.2.1": {"id": "3.2.1", "name": "Build DevSecOps Software Factory Part 1", "description": "The DoD enterprise creates the foundational standards for DevSecOps processes and CI/CD pipelines. The concepts are applied in a standard technology stack across DoD Components to meet future application security requirements. Integrate an enterprise-wide Vulnerability Management program with the CI/CD pipeline following the Vulnerability Management Program Activities [Application & Workload Pillar, Software Risk Management Capability].", "predecessor": [], "successor": ["3.2.2"], "outcomes": ["Developed data/service standards for DevSecOps", "CI/CD pipeline is fully functional and tested successfully", "Vulnerability management program is officially in place and operating"], "m": 19.3, "phase": 1}, "zt-3.2.2": {"id": "3.2.2", "name": "Build DevSecOps Software Factory Part 2", "description": "DoD Components use DevSecOps processes to develop new applications and update existing applications following their approved CI/CD pipelines. Applications that cannot be migrated to the CI/CD pipeline follow legacy processes. Validation functions continue to be integrated into the CI/CD pipelines and DevSecOps processes and existing applications to monitor for vulnerabilities.", "predecessor": ["3.2.1"], "successor": ["3.5.1"], "outcomes": ["Development of applications is migrated to CI/CD pipeline", "Continual validation process/technology is implemented and in use", "Development of applications is migrated to DevSecOps process and technology"], "m": 10.8, "phase": 2}, "zt-3.2.3": {"id": "3.2.3", "name": "Automate Application Security & Code Remediation Part 1", "description": "DoD implements a standardized approach to application security including code remediation. This activity begins with the integration of a secure API gateway with applications using API or similar calls. Code reviews are methodically conducted and provide standard protections for containers and their infrastructure. Additionally, serverless functions where a thirdparty manages the infrastructure (e.g., Platform as a Service) uses adequate serverless security monitoring and response functions. Code reviews, container and serverless security functions are integrated into the CI/CD or DevSecOps process as appropriate.", "predecessor": ["3.3.3", "2.5.1"], "successor": ["3.4.5", "3.2.4"], "outcomes": ["Secure API gateway is operational, and majority of API calls are passing through gateway", "Application security functions (e.g., code review, container and serverless security) are implemented as part of CI/CD pipeline and DevSecOps"], "m": 18.0, "phase": 3}, "zt-3.2.4": {"id": "3.2.4", "name": "Automate Application Security & Code Remediation Part 2", "description": "DoD Components modernize approaches to delivering internally developed and managed services following best practice approaches such as microservices. These approaches enable more resilient and secure architectures by allowing for quicker changes to code in each microservice as security issues are discovered. Further advanced security remediation activities continue across the DoD Enterprise with the inclusion of runtime security functions for containers as appropriate, automated vulnerability library updates and automated CI/CD approvals during the release process.", "predecessor": ["3.2.3"], "successor": [], "outcomes": ["All possible API calls are passing through the secure API gateway", "Services are provided following a Service Oriented Architecture (SOA)", "Security remediation activities (e.g., runtime security, library updates, release approvals, etc.) are fully automated"], "m": 16.2, "phase": 4}, "zt-3.3": {"id": "3.3", "name": "Software Risk Management", "description": "The Software Risk Management Capability ensures code used in applications/services and associated components is secure, vulnerabilities are reduced, and DoD is aware of potential risks in the code. DoD also can detect data in all states and the data is observable (e.g., data loss prevention (DLP) and data rights management (DRM)). DoD Components establishes a software and application risk management program that addresses foundational concepts such as a bill of materials (BOM), supplier risk management, approved code repositories and updated channels, and vulnerability management. Additional program processes include continual validation within the CI/CD pipelines and vulnerability maturation through use of external sources. The capability initially focuses on establishing a managed repository for secure code and binaries. DoD is implementing their Software Supply Chain Risk Management program in parallel with the first two activities in this Capability. Together these processes reduce vulnerabilities and identify any remaining risks associated with software code with a focus on the threat data and acceptance of public disclosure reports. This capability concludes with the automation of testing and reviews in software development factories.", "predecessor": [], "successor": [], "outcomes": []}, "zt-3.3.1": {"id": "3.3.1", "name": "Approved Binaries/Code", "description": "The DoD enterprise uses best practice approaches to manage approved binaries and code.", "predecessor": ["3.3.2"], "successor": [], "outcomes": ["Supplier sourcing risk evaluated and identified for approved sources", "Repository and update channel established for use by development teams", "BOM is created for applications identify source, supportability, and risk posture", "Industry standard (Infragard or SANS) and approved vulnerability databases are pulled in to be used in DevSecOps"], "m": 23.4, "phase": 1}, "zt-3.3.2": {"id": "3.3.2", "name": "Vulnerability Management Program Part 1", "description": "The DoD enterprise works with DoD Components to establish and manage a Vulnerability Management program. The program includes policy and standards agreed upon through the DoD approval system. The developed program includes at a minimum the tracking and management of public vulnerabilities based on DoD applications/services. DoD Components establish a vulnerability management team with key stakeholders where vulnerabilities are discussed and managed following the enterprise policy and standards.", "predecessor": ["3.3.1", "3.3.3"], "successor": [], "outcomes": ["Vulnerability management team is in place with appropriate stakeholder membership", "Vulnerability management policy and process is in place and agreed to with stakeholders", "Public sources of vulnerabilities are being utilized for tracking"], "m": 7.83, "phase": 1}, "zt-3.3.3": {"id": "3.3.3", "name": "Vulnerability Management Program Part 2", "description": "Processes for managing the disclosure of vulnerabilities in DoD maintained and operated services are established at the DoD enterprise level. DoD Components expand the vulnerability management program to track and manage closed vulnerability repositories such as DIB, CERT, and others.", "predecessor": ["3.3.2"], "successor": ["3.2.3"], "outcomes": ["Controlled (defense industrial base (DIB), computer emergency readiness team (CERT), etc.) sources of vulnerabilities are being utilized for tracking", "Vulnerability management program has a process for accepting external/public disclosures for managed services"], "m": 12.1, "phase": 2}, "zt-3.3.4": {"id": "3.3.4", "name": "Continual Validation", "description": "DoD Components implement a continual validation approach for application development where parallel deployment is conducted and integrated with an approved environment level (e.g., user acceptance testing (UAT) or production (Prod)). Applications unable to integrate continual validation into their CI/CD process are identified and exceptions are provided as needed using a methodical approach.", "predecessor": [], "successor": [], "outcomes": ["Updated applications are deployed in a live and/or production environment", "Applications that were marked for retirement and transition are decommissioned", "Continual validation tools are implemented and applied to code in the CI/CDpipeline", "Code requiring continuous validation is identified and validation criteria areestablished"], "m": 11.1, "phase": 2}, "zt-3.4": {"id": "3.4", "name": "Resource Authorization & Integration", "description": "The Resource Authorization & Integration Capability enables the ability to limit access to data, applications, assets, services (DAAS) and improves the ability to remove access when it is not needed. DoD establishes a standardized resource authorization gateway for authorizations via the CI/CD pipelines. Authorizations use an automated (e.g., software defined) approach in a live/production environment. Attributes are enriched using data gathered in other Phased Activities (e.g., from user and entity behavior analysis, user activity monitoring) or from the API and authorization gateways. Approved enterprise APIs are micro-segmented. There are two primary functions supporting the PDP, the first being authorization and access to resources and the second being enrichment of the data feeding the decisions. Software code baselines are created using the approved set of code libraires and packages. Resource authorization gateways are used for all possible applications/services. Applications unable to use gateways require an exception to continue or are planned for decommissioning. Authorizations are further integrated with the CI/CD pipeline for automated decision making.", "predecessor": [], "successor": [], "outcomes": []}, "zt-3.4.1": {"id": "3.4.1", "name": "Resource Authorization Part 1", "description": "The DoD Enterprise standardizes resource authorization approaches (e.g., software defined perimeter) with the DoD Components. At a minimum the resource authorization gateways will be integrated with identities and devices through a centralized PIP/PDP. Organizations deploy approved resource authorization gateways supporting external facing applications/services. Additional applications for migration and applications unable to be migrated are identified for exception or decommission.", "predecessor": ["1.8.1", "5.3.1"], "successor": ["3.4.2"], "outcomes": ["Resource authorization gateway is in place for external facing applications", "Resource authorization policy integrated with identity and device", "Enterprise-wide guidance on conversion standards is communicated to stakeholders"], "m": 18.5, "phase": 1}, "zt-3.4.2": {"id": "3.4.2", "name": "Resource Authorization Part 2", "description": "Resource authorization gateways are used for all possible applications/services. Applications unable to use gateways require an exception to continue or are planned for decommissioning. Authorizations are further integrated with the CI/CD pipeline for automated decision making.", "predecessor": ["3.4.1"], "successor": ["3.4.3"], "outcomes": ["Resource authorization gateway is utilized for all applications", "Resource authorization is integrated with DevSecOps and CI/CD for automated functions"], "m": 20.6, "phase": 2}, "zt-3.4.3": {"id": "3.4.3", "name": "Enrich Attributes for Resource Authorization Part 1", "description": null, "predecessor": ["1.6.3", "2.3.2", "5.4.2", "4.3.3", "4.6.3", "4.5.4"], "successor": ["3.4.4"], "outcomes": ["Resource authorization receives data from analytics engine", "Authorization policies incorporate identified attributes in making authorization decisions", "Attributes to be used for initial enrichment are identified", "Identified attributes are assigned to resources and/or entities"], "m": 17.6, "phase": 3}, "zt-3.4.4": {"id": "3.4.4", "name": "Enrich Attributes for Resource Authorization Part 2", "description": "Attributes are integrated with the resource authorization technology and policy. Confidence scoring is introduced across the attributes to create a more advanced method of authorization decision making in an automated fashion.", "predecessor": ["3.4.3"], "successor": [], "outcomes": ["Authorization policies incorporate confidence levels in making authorization decisions", "Confidence levels for attributes are defined"], "m": 17.8, "phase": 4}, "zt-3.4.5": {"id": "3.4.5", "name": "REST API Micro-segments", "description": "Using the DoD Enterprise approved API gateway(s), micro-segmented application calls only allow authenticated and authorized access to specific destinations (e.g., microservices). When possible, API micro-segmentation consoles are integrated and aware of other micro-segmentation consoles such as software defined perimeter controllers and software defined networking controllers.", "predecessor": ["3.2.3"], "successor": [], "outcomes": ["Approved enterprise APIs are micro-segmented appropriately"], "m": 18.1, "phase": 4}, "zt-3.4.6": {"id": "3.4.6", "name": "Software Defined Compute Resource Authorization Part 1", "description": "The DoD Enterprise provides a standardized approach for code-based computer management (i.e., SDC) following industry best practices. Software code baselines are created using the approved set of code libraires and packages. DoD Components work with the approved code/binary activities to identify applications that can support the SDC approach. Applications that can support current software-based configuration and management approaches are identified and transitioned to SDC. Applications that cannot follow software-based configuration and management approaches are identified and allowed through exception.", "predecessor": ["1.8.1", "5.3.1"], "successor": ["3.4.7"], "outcomes": ["Applications unable to be updated to use approved binaries/code are marked for retirement and transition plans are created", "Identified applications without approved binaries and code are updated to use approved binaries/code", "Enterprise-wide guidance on conversion standards is communicated to stakeholders"], "m": 31.1, "phase": 1}, "zt-3.4.7": {"id": "3.4.7", "name": "SDC Resource Authorization Part 2", "description": "Applications which support software-based configuration and management have been transitioned to a production/live environment and are in normal operations. Where possible applications which cannot support software-based configuration and management are decommissioned.", "predecessor": ["3.4.6"], "successor": [], "outcomes": ["Updated applications are deployed in a live and/or production environment", "Applications that were marked for retirement and transition are decommissioned"], "m": 21.8, "phase": 2}, "zt-3.5": {"id": "3.5", "name": "Continuous Monitoring and Ongoing Authorizations", "description": "The Continuous Monitoring and Ongoing Authorizations Capability provides near real time visibility into the effectiveness of deployed security controls. DoD employs automated tools and processes to continuously monitor applications and assess their authorization to operate. This is an advanced capability focused on implementing ongoing and continuous authorizations. When this capability has been fully implemented, DoD will have an automated control derivation, testing and monitoring processes. Monitoring results are displayed on dashboards that include the status of authorizations and analytics. The results are shared with the responsible authorizing officials who use the information to make ongoing or continuous authorization decisions.", "predecessor": [], "successor": [], "outcomes": []}, "zt-3.5.1": {"id": "3.5.1", "name": "cATO Part 1", "description": "DoD Components use automated solutions within the environment to standardize the monitoring of controls and offer the capability to identify deviations from expected results. Where appropriate, monitoring and testing is integrated with DevSecOps processes.", "predecessor": ["6.1.1", "3.2.2"], "successor": ["3.5.2"], "outcomes": ["Controls derivation is standardized and ready for automation", "Controls testing is integrated with DevSecOps processes and technology"], "m": 15.1, "phase": 3}, "zt-3.5.2": {"id": "3.5.2", "name": "cATO Part 2", "description": "DoD Components fully automate control derivation, testing and monitoring processes. Deviations from expected results are automatically tested and resolved using existing cross pillar automation infrastructure. Monitoring results are displayed on dashboards that include the status of authorizations and analytics. The results are shared with the responsible authorizing officials.", "predecessor": ["7.2.3", "6.7.4", "3.5.1"], "successor": [], "outcomes": ["Controls testing is fully automated", "Integration with standard IR and SOC operations is automated", "Control derivation and applicability is fully automated", "Dashboards are used to track continuing authorization status"], "m": 21.83, "phase": 4}, "zt-4.1": {"id": "4.1", "name": "Data Catalog Risk Alignment", "description": "The Data Catalog Risk Alignment Capability ensures data assets are known and can be collected, tagged, and protected per defined data governance. Data governance provides the principles, processes, frameworks, tools, metrics, and oversight to effectively manage data at all levels. For DoD, data governance will be executed at multiple levels, from localized system decisions to full records management of critical data assets within the Department. DoD will develop and maintain a basic, enterprise-wide data catalog, which categorizes data following guidance per DoD’s data classification and tagging standards. The data is prioritized for protection to meet Target level capability needs. Data owners are responsible for identifying and inventorying data, including the associated metadata, as part of data inventory for the organization. The data landscape is monitored for changes with the changes automatically detected and included within the Data Catalog. The data landscape is reviewed to identify potential risks related to data loss, attack, or any other unauthorized alteration or access. Data is F-9 encrypted for protection while at rest and in transit. The objective is visibility, management, and protection of all data across the Department.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.1.1": {"id": "4.1.1", "name": "Data Analysis", "description": "DoD Components update the data catalog with associated metadata and update the service and application catalog(s) with data classifications. Data tags are also added to each service and application.", "predecessor": [], "successor": [], "outcomes": ["The service catalog is updated with data types for each application and service based on data classification levels"], "m": 17.4, "phase": 0}, "zt-4.2": {"id": "4.2", "name": "DoD Enterprise Data Governance", "description": "The DoD Enterprise Data Governance Capability ensures appropriate behavior in the valuation, creation, consumption, and control of data and analytics through DoD’s decision rights and accountability framework. DoD Enterprise, together with the DoD Components, establishes data tagging and classification standards to ensure interoperability among DoD organizations. The group also establishes a SDS policy and standards and identifies appropriate storage technology for SDS implementation. This capability serves as a foundation for later activities in the Data and other pillars by defining a data tagging standard, defining a software storage policy, and most critically developing interoperability standards.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.2.1": {"id": "4.2.1", "name": "Define Data Tagging Standards", "description": "The DoD Enterprise works with organizations to establish data tagging and classification standards based on industry best practices. Classifications are agreed upon and implemented in processes. Tags are identified as manual and automated for future activities.", "predecessor": [], "successor": ["4.3.1", "4.3.2", "4.3.4", "6.3.1"], "outcomes": [], "m": 15.8, "phase": 1}, "zt-4.2.2": {"id": "4.2.2", "name": "Interoperability Standards", "description": "The DoD Enterprise, collaborating with the Components, develops interoperability standards integrating mandatory DRM and Protection solutions with necessary technologies to enable zero trust Target functionality.", "predecessor": [], "successor": ["4.5.1"], "outcomes": ["Formal standards are in place by the enterprise for the appropriate data standards"], "m": 14.4, "phase": 1}, "zt-4.2.3": {"id": "4.2.3", "name": "Develop Software Defined Storage (SDS) Policy", "description": "The DoD Enterprise works with the Components to establish an SDS policy and standards based on industry best practices. DoD Components evaluate current data storage strategy and technology for implementation of SDS.", "predecessor": [], "successor": ["4.7.1", "4.7.4", "4.7.6"], "outcomes": ["Determine needs for SDS tool implementation", "Policy for SDS is created at the enterprise and organization levels"], "m": 9.9, "phase": 2}, "zt-4.3": {"id": "4.3", "name": "Data Labeling and Tagging", "description": "The Data Labeling and Tagging Capability establishes machine enforceable metadata (i.e., data tags) using both manual and automated approaches. Data owners label and tag data in compliance with DoD enterprise labeling/tagging policy. As phases advance, automation and AI approaches are used to meet scaling demands and provide better accuracy. Data tags are later used by DLP and DRM solutions to protect and detect data through access controls, encryption, flow enforcement, and other security approaches.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.3.1": {"id": "4.3.1", "name": "Implement Data Tagging & Classification Tools", "description": "DoD Components use the enterprise standards and requirements to implement data tagging and classification solution(s). The Components ensure that future ML and AI integrations are supported by solutions through DoD enterprise requirements.", "predecessor": ["4.2.1"], "successor": ["4.6.1"], "outcomes": ["A requirement of Data classification and tagging tools must include integration and/or support of Machine Learning (ML)", "Data classification and tagging tools are implemented at organization and enterprise levels"], "m": 15.9, "phase": 1}, "zt-4.3.2": {"id": "4.3.2", "name": "Manual Data Tagging Part 1", "description": "Using the DoD Enterprise data tagging and classification policy and standards, manual tagging begins by using basic data level attributes to meet zero trust Target functionality.", "predecessor": ["4.2.1"], "successor": ["4.5.3", "4.6.2", "4.3.3"], "outcomes": ["Manual data tagging begins at the enterprise level with basic attributes"], "m": 17.6, "phase": 2}, "zt-4.3.3": {"id": "4.3.3", "name": "Manual Data Tagging Part 2", "description": "DoD organization-specific data level attributes are integrated into the manual data tagging process. DoD Enterprise and Components collaborate to decide which attributes are required to meet zero trust Advanced functionality. Data level attributes for zero trust Advanced functionality are standardized across the enterprise and incorporated.", "predecessor": ["4.3.2"], "successor": ["3.4.3"], "outcomes": ["Manual data tagging is expanded to the program/organization levels with specific attributes"], "m": 16.1, "phase": 3}, "zt-4.3.4": {"id": "4.3.4", "name": "Automated Data Tagging & Support Part 1", "description": "DoD Components use data loss prevention, rights management, and protection solutions to scan data repositories. Standardized tags are applied to supported data repositories and data types. Unsupported data repositories and types are identified.", "predecessor": ["4.2.1"], "successor": ["4.3.5"], "outcomes": ["Basic automation begins by scanning data repositories and applying tags"], "m": 14.1, "phase": 3}, "zt-4.3.5": {"id": "4.3.5", "name": "Automated Data Tagging & Support Part 2", "description": "The remaining supported data repositories have basic and extended data tags, which are applied using ML and AI. Extended data tags are applied to existing repositories. Unsupported data repositories and data types are evaluated for decommissioning based on risk. Approved exceptions use manual data tagging with data owners or custodians responsible for managing data tagging.", "predecessor": ["4.3.4"], "successor": [], "outcomes": ["Full automation of data tagging is completed", "Results of data tagging are fed into ML algorithms to develop AI driven data tagging"], "m": 38.8, "phase": 4}, "zt-4.4": {"id": "4.4", "name": "Data Monitoring and Sensing", "description": "The Data Monitoring and Sensing Capability ensures data in all states are detectable and observable, and supports later phase controls (e.g., DLP and DRM). Data owners capture active metadata that includes information about the access, sharing, transformation, and use of their data assets. DLP and DRM enforcement point analysis is conducted to determine where tooling should be deployed. Data outside of DLP and DRM scope such as file shares and databases is actively monitored for anomalous and malicious activity using alternative tooling.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.4.1": {"id": "4.4.1", "name": "DLP Enforcement Point Logging and Analysis", "description": "DoD Components identify DLP enforcement points such as specific services and user endpoints. Using the established DoD Enterprise cybersecurity incident response standard, DoD Components ensure the F-25 appropriate detail of data is captured. Additionally, protection, detection, and response use cases are developed to better outline solution coverage.", "predecessor": [], "successor": ["4.4.6"], "outcomes": ["Enforcement points are identified", "Standardized logging schema is enforced at the enterprise and organization levels"], "m": 10.78, "phase": 0}, "zt-4.4.2": {"id": "4.4.2", "name": "DRM Enforcement Point Logging and Analysis", "description": "DoD Components identify DRM enforcement points such as specific services and user endpoints. Using the established DoD enterprise cybersecurity incident response standard, DoD Components ensure the appropriate detail of data is captured. Additionally, protection, detection, and response use cases are developed to better outline solution coverage.", "predecessor": [], "successor": ["4.4.6"], "outcomes": ["Enforcement points are identified", "Standardized logging schema is enforced at the enterprise and organization levels"], "m": 12.62, "phase": 0}, "zt-4.4.3": {"id": "4.4.3", "name": "File Activity Monitoring Part 1", "description": "DoD Components use file monitoring tools to monitor critical data classification levels in applications, services, and repositories. Analytics from monitoring are fed into the SIEM with basic data attributes to accomplish zero trust Target functionality.", "predecessor": [], "successor": ["4.4.4"], "outcomes": ["Data and files of critical classification are actively being monitored", "Basic Integration is in place with monitoring system such as the SIEM"], "m": 16.8, "phase": 1}, "zt-4.4.4": {"id": "4.4.4", "name": "File Activity Monitoring Part 2", "description": "DoD Components use file monitoring tools to monitor all regulatory protected data (e.g., controlled unclassified information (CUI), PII, private health information (PHI), etc.) in applications, services, and repositories. Extended integration is used to send data to appropriate inter/intra-pillar solutions such as DLP, DRM and Protection solutions, and UEBA.", "predecessor": ["4.4.3"], "successor": ["1.2.3", "4.4.6", "4.4.5"], "outcomes": ["Data and files of all regulated classifications are actively being monitored", "Extended integrations are in place as appropriate to further manage risk"], "m": 18.9, "phase": 2}, "zt-4.4.5": {"id": "4.4.5", "name": "Database Activity Monitoring", "description": "DoD Components procure, implement, and use database monitoring solutions to monitor all databases containing regulated data types (e.g., CUI, PII, PHI, etc.). Logs and analytics from the database monitoring solution are fed to the SIEM for monitoring and response. Analytics are fed into cross pillar activities such as Activity 6.1.3, Enterprise Security Profile [Automation & Orchestration Pillar, Policy Decision Point and Policy Orchestration Capability] and Activity 5.2.5, Real-time Access [Network & Environment Pillar, Software Defined Networking Capability] to better inform decision making.", "predecessor": ["4.4.4"], "successor": ["4.4.6"], "outcomes": ["Appropriate databases are being actively monitored", "Monitoring technology is integrated with solutions such as SIEM, PDP, and dynamic access control mechanisms"], "m": 18.2, "phase": 3}, "zt-4.4.6": {"id": "4.4.6", "name": "Comprehensive Data Activity Monitoring", "description": "DoD Components expand data repository monitoring including databases based on risk. Additional data attributes to meet the zero trust Advanced functionalities are integrated into the analytics.", "predecessor": ["4.4.1", "4.4.2", "4.4.5", "4.4.4"], "successor": ["7.4.1"], "outcomes": ["Data activity monitoring mechanisms are integrated to provide a unified view of monitoring across data repositories", "Appropriate integrations exist with solutions such as SIEM and PDP"], "m": 27.2, "phase": 4}, "zt-4.5": {"id": "4.5", "name": "Data Encryption & Rights Management", "description": "The Data Encryption & Rights Management Capability reduces the risk of unauthorized data access and improves data security through encryption and data rights management. DoD Components establish and implement a strategy for encrypting data at rest and in transit using DRM tooling. The DRM solution uses data tags to determine protection and integrates with ML and AI to automate protection.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.5.1": {"id": "4.5.1", "name": "Implement DRM and Protection Tools Part 1", "description": "DoD Components procure and implement DRM and Protection solution(s) as needed following the DoD enterprise standard and requirements. Newly implemented DRM and Protection solution(s) are integrated into high risk data repositories using zero trust Target level protections.", "predecessor": ["4.2.2"], "successor": ["4.5.2"], "outcomes": ["DRM and Protection tools are enabled for high risk data repositories with basic protections"], "m": 11.7, "phase": 1}, "zt-4.5.2": {"id": "4.5.2", "name": "Implement DRM and Protection Tools Part 2", "description": "DRM and Protection solution coverage is expanded to cover all in scope data repositories. Encryption keys are automatically managed to meet best practices (e.g., Federal Information Processing Standards (FIPS)). Extended data protection attributes are implemented based on the environment classification.", "predecessor": ["4.5.1"], "successor": [], "outcomes": ["DRM and Protection tools are enabled for possible repositories"], "m": 22.0, "phase": 2}, "zt-4.5.3": {"id": "4.5.3", "name": "DRM Enforcement via Data Tags and Analytics Part 1", "description": "DRM and Protection solutions are integrated with basic data tags defined by the DoD enterprise standard. Initial data repositories are monitored and have protect and response actions enabled. Data at rest is encrypted in repositories.", "predecessor": ["4.3.2"], "successor": ["4.5.4"], "outcomes": ["Data Tags are integrated with DRM and monitored repositories are expanded", "Based on data tags, data is encrypted at rest"], "m": 16.2, "phase": 2}, "zt-4.5.4": {"id": "4.5.4", "name": "DRM Enforcement via Data Tags and Analytics Part 2", "description": "Extended data repositories are protected with DRM and Protection solutions. DoD Components implement extended data tags applicable to organizations versus mandated enterprise data tags. Data is encrypted in extended repositories using additional tags.", "predecessor": ["4.5.3"], "successor": ["3.4.3", "4.5.5"], "outcomes": ["All applicable data repositories are protected using DRM", "Data is encrypted using extended data tags from the organization levels"], "m": 19.0, "phase": 3}, "zt-4.5.5": {"id": "4.5.5", "name": "DRM Enforcement via Data Tags and Analytics Part 3", "description": "DRM and Protection solutions integrate with AI and ML tooling for encryption, DRM and Protection functions.", "predecessor": ["4.5.4"], "successor": [], "outcomes": ["Analytics from ML/AI are integrated with DRM to better automate protections", "Encryption protection is integrated with AI/ML and updated encryption methods are used as needed"], "m": 23.3, "phase": 4}, "zt-4.6": {"id": "4.6", "name": "Data Loss Prevention", "description": "The DLP Capability detects data leakage and exfiltration attempts and prevents them at the previously analyzed enforcement points. DoD Components use the identified enforcement points to deploy approved DLP tools and integrate tagged data attributes with DLP. Initially the DLP solution is put into a \"monitor-only\" mode to limit business impact and later when using analytics, it is put into a \"prevent\" mode. Extended data tag attributes are used to feed the DLP solution and integrate with ML and AI.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.6.1": {"id": "4.6.1", "name": "Implement Enforcement Points", "description": "The DLP solution is deployed to the in-scope enforcement points and is set to “monitor-only” or “learning” mode, limiting impact. DLP solution results are analyzed, and policy is fine tuned to manage risk to an acceptable level.", "predecessor": ["4.3.1"], "successor": ["5.4.3"], "outcomes": ["Identified enforcement points have DLP tool deployed and set to monitor mode with standardized logging"], "m": 21.2, "phase": 1}, "zt-4.6.2": {"id": "4.6.2", "name": "DLP Enforcement via Data Tags and Analytics Part 1", "description": "The DLP solution is updated from monitor only mode to prevention mode. The basic data tags used for the DLP solution are integrated with the logging schema.", "predecessor": ["4.3.2"], "successor": ["4.6.3"], "outcomes": ["Enforcement points to set to prevent mode integrating the logging schema and manual tags"], "m": 21.3, "phase": 2}, "zt-4.6.3": {"id": "4.6.3", "name": "DLP Enforcement via Data Tags and Analytics Part 2", "description": "The DLP solution is updated to include extended data tags based on parallel automation activities.", "predecessor": ["4.6.2"], "successor": ["3.4.3", "4.6.4"], "outcomes": ["Enforcement points have extended data tag attributes applied for additional prevention"], "m": 19.0, "phase": 3}, "zt-4.6.4": {"id": "4.6.4", "name": "DLP Enforcement via Data Tags and Analytics Part 3", "description": "The DLP solution is integrated with automated data tagging techniques to include any missing enforcement points and tags.", "predecessor": ["4.6.3"], "successor": [], "outcomes": ["Automated tagging attributes are integrated with DLP and resulting metrics are used for ML"], "m": 41.6, "phase": 4}, "zt-4.7": {"id": "4.7", "name": "Data Access Control", "description": "The Data Access Control Capability ensures unauthorized entities, or any entity on an unauthorized device cannot access data. SDS is used to shorten response times by integrating storage configuration with Infrastructure as Code (IaC) best practices. DoD Components ensure appropriate access to, and use of data based on the data and user, non-person entity (NPE), or device properties. SDS is used to manage permissions to DAAS. The SDS solution(s) is integrated with DRM tooling, improving protections.", "predecessor": [], "successor": [], "outcomes": []}, "zt-4.7.1": {"id": "4.7.1", "name": "Integrate DAAS Access with SDS Policy Part 1", "description": "Using the DoD enterprise SDS policy, Components develop their DAAS policy with integration in mind. An SDS implementation guide is developed by DoD Components to address specific environmental conditions.", "predecessor": ["4.2.3"], "successor": ["4.7.2"], "outcomes": ["DAAS policy is developed with enterprise and organization level support", "SDS Integration plan is developed to support DAAS policy"], "m": 15.3, "phase": 2}, "zt-4.7.2": {"id": "4.7.2", "name": "Integrate DAAS Access w/ SDS Policy Part 2", "description": "DoD Organizations implement the DAAS policy in an automated fashion.", "predecessor": ["4.7.6", "4.7.1"], "successor": ["4.7.3"], "outcomes": ["DAAS Policy implemented in an automated fashion"], "m": 12.6, "phase": 3}, "zt-4.7.3": {"id": "4.7.3", "name": "Integrate DAAS Access with SDS Policy Part 3", "description": "Newly implemented SDS technology and functionalities are integrated with the DAAS policy based on risk. Implement the technology and functionality following a phased approach to measure results and adjust accordingly.", "predecessor": ["4.7.2"], "successor": [], "outcomes": ["SDS is integrated with DAAS policy functionality"], "m": 9.2, "phase": 4}, "zt-4.7.4": {"id": "4.7.4", "name": "Integrate Solution(s) and Policy with Enterprise IdP Part 1", "description": "DoD Components develop an integration plan using the SDS policy and technology and functionality with the enterprise IdP solution.", "predecessor": ["4.2.3", "2.1.3"], "successor": ["4.7.6", "4.7.5"], "outcomes": ["Integration plan with SDS is developed to support existing DAAS access"], "m": 13.9, "phase": 2}, "zt-4.7.5": {"id": "4.7.5", "name": "Integrate Solution(s) and Policy with Enterprise IdP Part 2", "description": "Newly implemented SDS technology and functionalities are integrated with the Enterprise IdP following the integration plan. Identity attributes required to meet zero trust Target functionalities are required for integration.", "predecessor": ["4.7.4"], "successor": [], "outcomes": ["If needed implement SDS tooling and integrate with Enterprise IdP to support existing DAAS access"], "m": 9.2, "phase": 3}, "zt-4.7.6": {"id": "4.7.6", "name": "Implement SDS Tool and/or integrate with DRM Tool Part 1", "description": "Depending on the need for a SDS tool, a new solution is implemented, or an existing solution identified that meets the functionality requirements to be integrated with DLP, DRM and Protection, and ML solutions.", "predecessor": ["4.2.3", "4.7.4"], "successor": ["4.7.2", "4.7.7"], "outcomes": ["If tooling is needed ensure there is supported integrations with DLP, DRM and ML tooling"], "m": 17.4, "phase": 3}, "zt-4.7.7": {"id": "4.7.7", "name": "Implement SDS Tool and/or integrate with DRM Tool Part 2", "description": "DoD Components configure the SDS functionality and solution to be integrated with the underlying DLP and DRM and Protection infrastructure as appropriate. Lower-level integrations enable more effective protection and response.", "predecessor": ["4.7.6"], "successor": [], "outcomes": ["Integrate SDS infrastructure with existing DLP and DRM infrastructure"], "m": 15.3, "phase": 4}, "zt-5.1": {"id": "5.1", "name": "Data Flow Mapping", "description": "The Data Flow Mapping Capability establishes the foundation for network segmentation and tighter access control by understanding data traffic on the network. DoD Components reconcile data flows by gathering, mapping, and visualizing network traffic data flows and patterns to ensure authorized access and protection for network and DAAS resources specifically tagging programmatic (e.g., API) access when possible. The capability begins during Discovery with the DoD Components, in consultation with the DoD Enterprise, establishing network access rules and policies to ensure future supportability. The standards are used to develop data filters for API access to the Software Defined Networking (SDN) infrastructure. Initially these are implemented with non-mission or task critical applications and services.", "predecessor": [], "successor": [], "outcomes": []}, "zt-5.1.1": {"id": "5.1.1", "name": "Define Granular Control Access Rules & Policies Part 1", "description": "The DoD Enterprise, working with the DoD Components create granular network access rules and policies. DoD Components develop associated CONOPS in alignment with the network access rules and policies to ensure future supportability and implement the access policies into G-8 existing network technologies (e.g., next generation firewalls, intrusion prevention systems, etc.) to improve risk levels.", "predecessor": [], "successor": ["5.2.1", "5.1.2"], "outcomes": ["Provide technical standards", "Develop Concept of Operations (CONOPS)", "Identify Communities of Interest (COI)"], "m": 10.3, "phase": 0}, "zt-5.1.2": {"id": "5.1.2", "name": "Define Granular Control Access Rules & Policies Part 2", "description": "DoD Components use data tagging and classification standards to develop data filters for API access to the SDN infrastructure. API decision points are formalized within the SDN architecture and implemented with non-mission or task critical applications and services.", "predecessor": ["5.1.1"], "successor": [], "outcomes": ["Define data tagging filters for API infrastructure"], "m": 8.0, "phase": 1}, "zt-5.2": {"id": "5.2", "name": "Software Defined Networking", "description": "The SDN Capability enables the control of packets to centralized or distributed gateways, provides additional visibility into the network, and enables integration with access control tools like Policy Decision Points (PDP). DoD Components define API decision points and implement SDN programmable infrastructure to separate the control and data planes, and centrally manage and control the elements in the data plane. To accomplish the plane separation, Components confirm communications, such as API keys, can pass between the SDN infrastructure and PDPs or segmentation gateways. Analytics are integrated into real time decision making for access to resources. Initially the SDN Capability is focused on developing foundational integration points between the SDN infrastructure using industry standard APIs, or preferably a single API. This drives future interoperability and scalability issues. Once implemented, network flow segmentation occurs breaking up the network into different planes. In later activities, there is a focus on optimization and ongoing management of the network through discovery. Performance optimization is conducted in the SDN infrastructure. To enable real-time access decision making, this capability is integrated with cross and intra-pillar activities. In the future, machine learning will be used to guide decision making processes in the SDN infrastructure.", "predecessor": [], "successor": [], "outcomes": []}, "zt-5.2.1": {"id": "5.2.1", "name": "Define SDN APIs", "description": "The DoD Enterprise works with DoD Components to define the necessary APIs and other programmatic interfaces to enable SDN functionalities (e.g., onboarding of an application or other resource, allowing or disallowing access to or from a resource). These APIs will enable automation of authentication decision points, application delivery control proxies, and segmentation gateways.", "predecessor": ["5.1.1"], "successor": ["5.2.2"], "outcomes": ["SDN APIs are standardized and implemented", "APIs are functional for authentication decision point, application delivery control proxy, and segmentation gateway"], "m": 8.28, "phase": 0}, "zt-5.2.2": {"id": "5.2.2", "name": "Implement SDN Programable Infrastructure", "description": "Following the API standards, requirements, and SDN API functionalities, DoD Components implement SDN infrastructure to enable automation tasks. Segmentation gateways and authentication decision points are integrated into the SDN infrastructure along with output logging into a standardized repository (e.g., SIEM, log analytics) for monitoring and alerting.", "predecessor": ["5.2.1", "6.6.2"], "successor": [], "outcomes": ["Implemented application delivery control proxy", "Established SIEM logging activities", "Implemented user activity monitoring (UAM)", "Integrated with authentication decision point", "Implemented segmentation gateways"], "m": 32.0, "phase": 1}, "zt-5.2.3": {"id": "5.2.3", "name": "Segment Flows into Control, Management, and Data Planes", "description": "Network infrastructure and flows are segmented either physically or logically into control, management, and data planes. Basic segmentation using IPv6 or VLAN approaches is implemented to better organize traffic across data planes. Analytics and network flow data from the updated infrastructure is automatically fed into operations centers and analytics tools.", "predecessor": [], "successor": ["5.3.2", "5.4.2"], "outcomes": ["IPv6 segmentation", "Enable automated NetOps information reporting", "Ensure configuration control across enterprise", "Integrated with SOAR"], "m": 13.0, "phase": 2}, "zt-5.2.4": {"id": "5.2.4", "name": "Network Asset Discovery & Optimization", "description": "DoD Components automate network asset discovery through the SDN infrastructure limiting access to devices based on risk based approaches. Optimization is conducted based on the SDN analytics to improve overall performance along with approved access to resources.", "predecessor": [], "successor": [], "outcomes": ["Technical refreshment/technology evolution", "Provide optimization/performance controls"], "m": 30.2, "phase": 3}, "zt-5.2.5": {"id": "5.2.5", "name": "Real-Time Access Decisions", "description": "SDN infrastructure uses cross pillar data sources such as UAM, entity activity monitoring, enterprise security profiles and more for realtime access decisions. Machine learning is used to assist decision making based on advanced network analytics (full packet capture, etc.). Policies are consistently implemented across the enterprise using unified access standards.", "predecessor": ["1.8.4", "1.6.3", "2.2.2", "2.3.2", "7.6.1", "6.1.4"], "successor": [], "outcomes": ["Analyze SIEM logs with analytics engine to provide real-time policy access decisions", "Support sending captured packets, data/network flows, and other specific logs for analytics", "Segment end-to-end transport network flows", "Audit security policies for consistency across enterprise", "Protect data-in-transit during coalition information sharing"], "m": 15.6, "phase": 3}, "zt-5.3": {"id": "5.3", "name": "Macro-segmentation", "description": "The Macro-segmentation Capability provides network segmentation defined by large boundaries to enable resource segmentation by function, location, and user type. DoD Components establish network boundaries and provide security against networked assets located within an environment by validating the device, user, or NPE on each attempt of accessing a remote resource prior to connection. Macro-segmentation begins as a target level activity during Phase 1. Activities in the capability are focused on broad level network segmentation using geographical and logical network segment approaches. The outcomes are generally well established in the industry but integration into SDN infrastructure and user/entity behavioral monitoring are recent concepts.", "predecessor": [], "successor": [], "outcomes": []}, "zt-5.3.1": {"id": "5.3.1", "name": "Datacenter Macro-segmentation", "description": "DoD Components implement datacenter focused macro-segmentation using traditional tiered (e.g., web, applications, databases) or service-based architectures. Proxy and enforcement checks are integrated with the SDN solution(s) based on device attributes and behavior.", "predecessor": ["5.4.1", "3.4.1", "3.4.6"], "successor": [], "outcomes": ["Log actions to SIEM", "Establish proxy & enforcement checks of device attributes, behavior, and other data", "Analyze activities with analytics engine"], "m": 17.6, "phase": 1}, "zt-5.3.2": {"id": "5.3.2", "name": "B/C/P/S Macro-segmentation", "description": "DoD Components implement B/C/P/S macrosegmentation using logical network zones limiting lateral movement. Proxy and enforcement checks are integrated with the SDN solution(s) based on device attributes and behavior.", "predecessor": ["5.2.3"], "successor": [], "outcomes": ["Log actions to SIEM", "Establish proxy & enforcement checks of device attributes, behavior, and other data", "Analyze activities with analytics engine", "Leverage SOAR to provide RT policy access decisions"], "m": 18.1, "phase": 2}, "zt-5.4": {"id": "5.4", "name": "Micro-segmentation", "description": "The Micro-segmentation Capability builds upon macro-segmentation by shrinking the network boundary from segments and geo-locations to hosts, devices, applications, and processes. This is enabled by narrower segmentation in a virtualized environment via identity or application access and supports dynamic, real-time access decisions and policy changes. Automation is used to apply policy changes through programmatic (e.g., API) approaches. This capability also allows for improved protection of data in transit as it crosses system boundaries (e.g., in a coalition environment, system high boundaries) using solutions such as cryptography. Protection solutions are implemented at all segmentation boundaries including coalition sharing. [Note: This activity does not specifically enforce the use of cryptography but if not used, a comparable protection method must be implemented.] Initially activities focus on basic micro-segmentation functions and integration with API decisions points using the predecessor Activity 5.3.1: Datacenter Macro-segmentation [Network & Environment Pillar, Macro-segmentation Capability]. Once functionality is in place, hosts and devices are micro-segmented quickly followed by application focused micro-segmentation using G-21 the decisions points. The last stage of micro-segmentation is host-based process segmentation. Existing SDN infrastructure and decision points are used to enable process micro-segmentation. If existing infrastructure does not enable micro-segmentation, security teams may need to look at solution procurement.", "predecessor": [], "successor": [], "outcomes": []}, "zt-5.4.1": {"id": "5.4.1", "name": "Implement Micro-segmentation", "description": "DoD Organizations integrate a microsegmentation infrastructure into SDN environments enabling basic segmentation of service components (e.g., web, application, database), ports and protocols. Basic automation is accepted for policy changes including API decision making. Virtual hosting environments implement micro-segmentation at the host or container level.", "predecessor": ["5.3.1"], "successor": ["5.4.2"], "outcomes": ["Accept automated policy changes", "Implement API decision points", "Implement NGF (Next Generation Firewall)/Micro FW (Firewall)/endpoint agent in virtual hosting environment"], "m": 17.3, "phase": 1}, "zt-5.4.2": {"id": "5.4.2", "name": "Application & Device Micro-segmentation", "description": "DoD Components use SDN solution(s) to establish infrastructure meeting the zero trust target functionalities – logical network zones, role, attribute and conditional based access control for user and devices, privileged access management services for network resources, and policy-based control on API access.", "predecessor": ["5.2.3", "5.4.1"], "successor": ["3.4.3"], "outcomes": ["Assign role, attribute, and condition based access control to user and devices", "Provide privileged access management services", "Limit access on per identity basis for user and device", "Create logical network zones", "Support policy control via REST API"], "m": 17.9, "phase": 2}, "zt-5.4.3": {"id": "5.4.3", "name": "Process Micro-segmentation", "description": "DoD Components use existing micro-segmentation and SDN automation infrastructure enabling process micro-segmentation. Host-level processes are segmented based on security policies and access is granted using real-time access decision making.", "predecessor": ["4.6.1"], "successor": [], "outcomes": ["Segment host-level processes for security policies", "Support real-time access decisions and policy changes", "Support offload of logs for analytics and automation", "Support dynamic deployment of segmentation policy"], "m": 20.3, "phase": 3}, "zt-5.4.4": {"id": "5.4.4", "name": "Protect Data in Transit", "description": "DoD Components mandate protection of data in transit through policies and include common use cases (e.g., Coalition Information Sharing, Sharing Across System Boundaries, and Protection across Architectural Components).", "predecessor": [], "successor": [], "outcomes": ["Protect data in transit during coalition information sharing", "Protect data in transit across system high boundaries", "Integrate data in transit protection across architecture components"], "m": 9.1, "phase": 2}, "zt-6.1": {"id": "6.1", "name": "Policy Decision Point & Policy Orchestration", "description": "The Policy Decision Point (PDP) & Policy Orchestration Capability uses PDPs and PEPs to ensure proper implementation of data, applications, assets, services (DAAS) access policies to users or endpoints that are properly connected (or denied access) to requested resources. Initially, DoD Components collect and document all rule-based policies to orchestrate across the security stack for effective automation of access decisions. The DoD Components mature this capability by establishing PDPs and PEPs (including the Next Generation Firewall) to make DAAS resource determinations and enable, monitor, and terminate connections between a user or device and DAAS resources according to predefined policy. DAAS access procedures and policies will be reviewed for missing zero trust concepts and principles, updated, and implemented.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.1.1": {"id": "6.1.1", "name": "Policy Inventory & Development", "description": "DoD Enterprise works with the DoD Components to catalog and inventory existing cybersecurity policies and standards. The inventory captures access control and identification, and authentication policies and standards from all organizational levels to identify conflicts or gaps. Policies and procedures are updated and integrated in cross-pillar activities as needed to meet critical zero trust Target functionality.", "predecessor": [], "successor": ["3.5.1"], "outcomes": ["Policies have been collected in reference to applicable compliance and risk (e.g., RMF, NIST, etc.)", "Policies have been reviewed for missing pillars and capabilities per the Zero Trust Reference Architecture", "Missing areas of policies are updated to meet the capabilities per the Zero Trust Reference Architecture"], "m": 9.78, "phase": 0}, "zt-6.1.2": {"id": "6.1.2", "name": "Organization Access Profile", "description": "DoD Components develop basic access profiles for mission and task related DAAS access using the data from the User, Data, Network, and Device pillars. DoD Enterprise works with the DoD Components to develop an enterprise security profile using the existing organizational security profiles to create a common access approach to accessing DAAS. A phased approach can be used by Components to limit risk to mission or task critical DAAS access once the security profile(s) are created.", "predecessor": [], "successor": ["6.1.3"], "outcomes": ["Organization scoped profile(s) are created to determine access to DAAS using capabilities from User, Data, Network, and Device Pillars", "Initial enterprise profile access standard is developed for access to DAAS", "When possible, the organization profile(s) utilizes enterprise available services in the User, Data, Network, and Device Pillars", "Organization mission/task critical profile(s) are created"], "m": 19.39, "phase": 1}, "zt-6.1.3": {"id": "6.1.3", "name": "Enterprise Security Profile Part 1", "description": "Initially, the enterprise security profile covers the User, Data, Network, and Device pillars. Existing DoD Component security profiles are integrated for non-mission/task DAAS access following an iterative approach to finetuning access.", "predecessor": ["6.1.2"], "successor": ["6.1.4"], "outcomes": ["Enterprise profile(s) are created to access DAAS using capabilities from User, Data, Network, and Device Pillars", "Non-mission/task critical organization profile(s) are integrated with the enterprise profile(s) using a standardized approach"], "m": 16.0, "phase": 2}, "zt-6.1.4": {"id": "6.1.4", "name": "Enterprise Security Profile Part 2", "description": "At the conclusion of this activity, a minimum number of enterprise security profile(s) will exist granting access to the widest range of DAAS across pillars within the DoD Components. Mission/task organization profiles are integrated with the enterprise security profile(s) and exceptions are managed following a risk-based approach.", "predecessor": ["6.1.3"], "successor": ["5.2.5", "7.6.2"], "outcomes": ["Enterprise profile(s) have been reduced and simplified to support widest array of access to DAAS", "Where appropriate mission/task critical profile(s) have been integrated and supported. Organization profiles are considered the exception"], "m": 12.5, "phase": 3}, "zt-6.2": {"id": "6.2", "name": "Critical Process Automation", "description": "The Critical Process Automation Capability reduces response time and increases capability with orchestrated workflows and risk management processes. DoD Components employ automation methods, such as robotic process automation (RPA), to address repetitive, predictable tasks for critical functions such as data enrichment, security controls, and incident response workflows following system security engineering principles. During the Discovery Phase all task activities that can be executed both manually and automated are identified and organized into categories. Manual activities are analyzed for possible retirement. DoD Enterprise establishes baseline integrations within the SOAR and prioritizes key integration points. As the capability matures remaining services are integrated, meeting zero trust Target functionalities.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.2.1": {"id": "6.2.1", "name": "Task Automation Analysis", "description": "DoD Components identify and enumerate all task activities that can be executed both manually and automated and organized into categories. Manual activities are analyzed for possible retirement.", "predecessor": [], "successor": [], "outcomes": ["Automatable tasks are identified", "Tasks are enumerated"], "m": 6.3, "phase": 0}, "zt-6.2.2": {"id": "6.2.2", "name": "Enterprise Integration & Workflow Provisioning Part 1", "description": "The DoD Enterprise establishes baseline integrations within the SOAR solution required to enable Target level zero trust functionality. DoD Components identify integration points and prioritize H-17 key ones per the DoD enterprise baseline. Critical integrations occur when meeting key services enabling recovery and protection capabilities.", "predecessor": [], "successor": ["6.2.3"], "outcomes": ["Implement full enterprise integration", "Identify key integrations", "Identify recovery and protection requirements"], "m": 23.4, "phase": 2}, "zt-6.2.3": {"id": "6.2.3", "name": "Enterprise Integration & Workflow Provisioning Part 2", "description": "DoD Components integrate remaining services to meet baseline requirements and Advanced zero trust functionality requirements as appropriate per environment. Service provisioning is integrated and automated into workflows where required meeting zero trust Target functionalities.", "predecessor": ["6.2.2"], "successor": ["6.7.4"], "outcomes": ["Services identified", "Service provisioning is implemented"], "m": 12.7, "phase": 3}, "zt-6.3": {"id": "6.3", "name": "Machine Learning", "description": "The Machine Learning (ML) Capability further reduces response time and increases capability with orchestrated workflows and risk management processes. DoD employs ML to execute (and enhance execution of) critical functions such as incident response, anomaly detection, user baselining, and data tagging. DoD Components use existing data tagging and classification standards and requirements to procure ML solution(s) as needed. ML solution(s) are implemented, and existing tagged data repositories are used to establish baselines. ML solution(s) applies data tags to continually improve analysis.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.3.1": {"id": "6.3.1", "name": "Implement Data Tagging & Classification ML Tools", "description": "DoD Components use existing data tagging and classification standards and requirements to procure ML solution(s) as needed. ML solution(s) use existing tagged data repositories to establish baselines. ML solution(s) apply data tags in a supervised approach to continually improve analysis.", "predecessor": ["4.2.1"], "successor": [], "outcomes": ["Implemented data tagging and classification tools are integrated with ML tools"], "m": 16.0, "phase": 2}, "zt-6.4": {"id": "6.4", "name": "Artificial Intelligence", "description": "The AI Capability further reduces response time and increases capability with the addition of AI in orchestrated workflows and risk management processes. DoD Components employ AI to execute (and enhance execution of) critical functions, particularly risk and access determinations, and environmental analysis. Advanced AI functionalities such as neural networks are used to modify policy and access controls. This shifts protection, detection, and response approaches to more anticipatory or pro-active to current reactive methods.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.4.1": {"id": "6.4.1", "name": "Implement AI Automation Tools", "description": "DoD Components identify areas of improvement (e.g., tagging, access control decisions, analytics, etc.) based on existing H-23 ML techniques for AI. AI solutions are identified, procured, and implemented using the identified improvement ideas as requirements.", "predecessor": [], "successor": [], "outcomes": ["Develop AI tool requirements", "Procure and implement AI tools"], "m": 25.7, "phase": 3}, "zt-6.4.2": {"id": "6.4.2", "name": "AI Driven by Analytics Decides Automation & Orchestration Modifications", "description": "DoD Components use existing ML functionality to implement and use AI technology such as neural networks to drive automation and orchestration decisions. Decision making (e.g., tagging, access control decisions, anomalous behavior detection decisions, etc.) is moved to AI as much as possible, freeing up human staff for other efforts. Using historical patterns, AI will anticipate changes in the environment to better reduce risk to unauthorized access to data.", "predecessor": [], "successor": [], "outcomes": ["AI is able to make changes to automated workflow activities"], "m": 42.0, "phase": 4}, "zt-6.5": {"id": "6.5", "name": "Security Orchestration, Automation & Response", "description": "The SOAR Capability uses pre-defined playbooks (e.g., collection, incident response) and triages initial process automation to accelerate a security team’s decision and response times. DoD Components achieve initial capability by ingesting alert data to orchestrate and automate policies (e.g., PEPs and PDPs) and establish rules to improve security operations, threat and vulnerability management, and security incident response.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.5.1": {"id": "6.5.1", "name": "Response Automation Analysis", "description": "DoD Components identify and enumerate all response activities and organize them into automated and manual categories. Manual activities are analyzed for possible retirement.", "predecessor": [], "successor": [], "outcomes": ["Automatable response activities are identified", "Response activities are enumerated"], "m": 9.0, "phase": 0}, "zt-6.5.2": {"id": "6.5.2", "name": "Implement SOAR Tools", "description": "DoD Enterprise working with Components develops a standard set of requirements for SOAR tooling to enable Target level zero trust functionality. DoD Components use approved requirements to procure and implement the SOAR solution. Basic infrastructure integrations for future SOAR functionality are completed.", "predecessor": ["6.7.1", "6.6.2"], "successor": [], "outcomes": ["Develop requirements for SOAR tool", "Procure SOAR tools"], "m": 14.9, "phase": 1}, "zt-6.5.3": {"id": "6.5.3", "name": "Implement Playbooks", "description": "DoD Components review all existing playbooks to identify ones for future automation. Develop playbooks for existing manual and automated processes missing playbooks. Playbooks are prioritized for automation and integrated with Activity 6.7.4, Automated Workflows [Automation & Orchestration Pillar, Security Operations Center & Incidence Response Capability] addressing critical processes. Manual processes without playbooks are authorized using a risk based approach.", "predecessor": [], "successor": [], "outcomes": ["When possible automated playbooks based on automated workflows capability", "Manual playbooks are developed and implemented"], "m": 14.0, "phase": 4}, "zt-6.6": {"id": "6.6", "name": "API Standardization", "description": "The API Standardization Capability improves application interfaces, enabling critical orchestration, and enhancing interoperability. DoD establishes and enforces enterprise-wide programmatic interface (e.g., API) standards. All non-compliant APIs are identified and replaced.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.6.1": {"id": "6.6.1", "name": "Tool Compliance Analysis", "description": "Automation and orchestration tooling and solutions are analyzed to determine if the appropriate capabilities are included, and the solutions comply with the DoD Enterprise programmatic interface standard and requirements. Any additional tooling or solutions are identified to support the standards.", "predecessor": [], "successor": [], "outcomes": ["API status is determined by compliance or non-compliance to API standards", "Tools to be used are identified"], "m": 7.3, "phase": 0}, "zt-6.6.2": {"id": "6.6.2", "name": "Standardized API Calls & Schemas Part 1", "description": "The DoD Enterprise works with Components to establish a programmatic interface (e.g., API) standard and requirements as needed to enable Target zero trust functionalities. DoD Components update programmatic interfaces to the new standards and mandate newly acquired/developed tools to meet the new standard. Tools unable to meet the standard are allowed by exception using a risk-based approach.", "predecessor": [], "successor": ["6.5.2", "5.2.2", "6.6.3"], "outcomes": ["Initial calls and schemas are implemented", "Non-compliant tools are replaced"], "m": 13.6, "phase": 1}, "zt-6.6.3": {"id": "6.6.3", "name": "Standardized API Calls & Schemas Part 2", "description": "DoD Components complete migration to the new programmatic interface standard. Tools marked for decommission in the previous activity are retired and functions are migrated to modernized tools. Approved schemas are adopted based on the DoD Enterprise standard/requirements", "predecessor": ["6.6.2"], "successor": [], "outcomes": ["All calls and schemas are implemented"], "m": 14.2, "phase": 2}, "zt-6.7": {"id": "6.7", "name": "Security Operations Center & Incident Response", "description": "The SOC & IR Capability enables standardized, coordinated, and accelerated incident response and investigative efforts with automation and enrichment of workflows reducing detection times and improving response actions. In the event a cybersecurity service provider (CSSP) does not exist, DoD organizations define and stand up security operations centers (SOC) to deploy, operate, and maintain security monitoring and protections and response for DAAS. SOCs provide security management visibility for status (upward visibility) and tactical implementation (downward visibility). Workflows within the SOC are automated using automation tooling and enrichment occurs between service providers and technologies.", "predecessor": [], "successor": [], "outcomes": []}, "zt-6.7.1": {"id": "6.7.1", "name": "Workflow Enrichment Part 1", "description": "DoD Enterprise works with organizations to establish a cybersecurity incident response standard using industry best practices such as NIST. DoD Components use the enterprise standard to determine incident response workflows. External sources of enrichment are identified for future integration.", "predecessor": [], "successor": ["6.5.2", "6.7.2"], "outcomes": ["Threat events are identified", "Workflows for threat events are developed"], "m": 7.3, "phase": 1}, "zt-6.7.2": {"id": "6.7.2", "name": "Workflow Enrichment Part 2", "description": "DoD Components identify and establish extended workflows for additional incident response types. Initial data sources are enriched and used for existing workflows. Additional enrichment sources are identified for future integrations.", "predecessor": ["6.7.1"], "successor": ["6.7.3"], "outcomes": ["Workflows for advanced threat events are developed", "Advanced threat events are identified"], "m": 9.1, "phase": 2}, "zt-6.7.3": {"id": "6.7.3", "name": "Workflow Enrichment Part 3", "description": "DoD Components use final enrichment data sources on basic and extended threat response workflows.", "predecessor": ["6.7.2"], "successor": ["6.7.4"], "outcomes": ["Enrichment data has been identified", "Enrichment data is integrated into workflows"], "m": 12.4, "phase": 3}, "zt-6.7.4": {"id": "6.7.4", "name": "Automated Workflow", "description": "DoD Components focus on automating SOAR functions and playbooks. Manual processes within security operations are identified and fully automated as possible. Remaining manual processes are decommissioned when possible or marked for exception using a risk-based approach.", "predecessor": ["6.2.3", "6.7.3"], "successor": ["3.5.2"], "outcomes": ["Workflow processes are fully automated", "Manual Processes have been identified", "Remaining Processes are marked as exceptions and documented"], "m": 14.4, "phase": 4}, "zt-7.1": {"id": "7.1", "name": "Log All Traffic (Network, Data, Apps, Users)", "description": "The Log All Traffic (Network, Data, Apps, Users) Capability enables advanced detection and response for improved detection and response of adverse events or incidents. This capability is foundational to the development of automated hunting for indicators of compromise and incident response playbooks. Initially the logging and alerting infrastructure is evaluated for future increased storage and computing requirements. Additionally, critical zero trust components (i.e., PDPs and PEPs) are analyzed to ensure they are built and configured resiliently. DoD Components collect and process all logs including network, data, application, device, and user logs and make those logs available to the appropriate Cybersecurity Service Provider (CSSP) or security operations center (SOC). Rules and analytics are developed as needed. Logs and events are recorded following a standardized DoD enterprise-wide format.", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.1.1": {"id": "7.1.1", "name": "Scale Considerations", "description": "DoD Components conduct analysis to determine current and future logging requirements to ensure the logging solution can scale to meet those additional needs. Scaling is analyzed following common industry best practice methods. Other zero trust pillar capabilities generate log data and those capabilities are analyzed for scaling considerations. The Component implementation team works with existing Business Continuity Planning (BCP) and Disaster Recovery Planning (DRP) groups to determine distributed environment and scaling concerns during emergencies and due to the impact of organizational growth on logging requirements.", "predecessor": [], "successor": [], "outcomes": ["Sufficient infrastructure in place", "Distributed environment established", "Sufficient bandwidth for network traffic"], "m": 11.6, "phase": 0}, "zt-7.1.2": {"id": "7.1.2", "name": "Log Parsing", "description": "DoD Components identify and prioritize log and flow sources (e.g., firewalls, endpoint detection & response, active directory, switches, routers, etc.) and develop a plan for collection of audit logs, initially for high priority logs followed by low priority logs. An open industry-standard log format is agreed upon at the DoD Enterprise level with the Components and integrated into future procurement requirements. Existing solutions and technologies are migrated to the agreed-upon format.", "predecessor": [], "successor": ["7.2.4", "7.3.1"], "outcomes": ["Standardized log formats", "Rules developed for each log format"], "m": 6.3, "phase": 1}, "zt-7.1.3": {"id": "7.1.3", "name": "Log Analysis", "description": "Common user and device activities are identified and prioritized based on risk. Activities deemed the most simplistic and risky have analytics created using different data sources such as logs. Trends and patterns are developed based on the analytics collected to look at activities over longer periods of time.", "predecessor": [], "successor": ["7.2.5", "7.4.1", "7.3.2"], "outcomes": ["Identify activities to analyze", "Develop analytics per activity"], "m": 10.3, "phase": 2}, "zt-7.2": {"id": "7.2", "name": "Security Information and Event Management", "description": "The SIEM Capability enables effective security analysis of anomalous user behavior, alerting, and automation of relevant incident response to common threat events by processing and exploiting data in the SIEM. CSSPs or SOCs monitor, detect, and analyze data logged into a SIEM tool. User and device baselines, reflecting typical activities and behaviors by user and device, are created using security controls and integrated with the SIEM. Alerting within the SIEM is matured to support more advanced data points (e.g., cyber threat intelligence, activity baselines, etc.).", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.2.1": {"id": "7.2.1", "name": "Threat Alerting Part 1", "description": "DoD Components use existing SIEM solutions to develop basic rules and alerts for common threat events (malware, phishing, etc.). Alerts or rule firings are fed into the parallel Activity 7.2.4, Asset ID & Alert Correlation [Visibility & Analytics Pillar, SIEM Capability] to begin automation of responses.", "predecessor": [], "successor": ["2.7.2", "7.2.2"], "outcomes": ["Rules developed for threat correlation"], "m": 7.5, "phase": 1}, "zt-7.2.2": {"id": "7.2.2", "name": "Threat Alerting Part 2", "description": "DoD Components expand threat alerting in the SIEM solution to include Cyber Threat Intelligence (CTI) data feeds. Deviation and anomaly rules are developed in the SIEM to detect advanced threats.", "predecessor": ["7.5.1", "7.2.1"], "successor": ["7.2.3"], "outcomes": ["Develop analytics to detect deviations"], "m": 16.5, "phase": 2}, "zt-7.2.3": {"id": "7.2.3", "name": "Threat Alerting Part 3", "description": "Threat alerting is expanded to include advanced data sources from solutions such as XDR, UEBA, and UAM. These solutions with advanced data sources are used to improve anomalous patterns of activity detections.", "predecessor": ["2.7.3", "7.2.2"], "successor": ["3.5.2"], "outcomes": ["Extended Detection & Response (XDR), User & Entity Behavior Analytics (UEBA), and User Activity Monitoring (UAM) data sources are added for threat alerting", "Identify triggering anomalous events", "Implement triggering policy"], "m": 12.9, "phase": 3}, "zt-7.2.4": {"id": "7.2.4", "name": "Asset ID & Alert Correlation", "description": "DoD Components develop basic correlation rules using asset and alert data. Response to common threat events (e.g., malware, phishing, etc.) are automated within the SIEM solution.", "predecessor": ["7.1.2"], "successor": [], "outcomes": ["Rules developed for asset ID based responses"], "m": 10.2, "phase": 1}, "zt-7.2.5": {"id": "7.2.5", "name": "User/Device Baselines", "description": "DoD Organizations develop user and device baseline approaches based on DoD Enterprise standards for the appropriate pillar. Attributes utilized in baselining are pulled from the enterprise-wide standards developed in cross pillar activities.", "predecessor": ["1.6.1", "7.1.3"], "successor": ["1.6.3", "2.3.1"], "outcomes": ["Identify user and device baselines"], "m": 13.0, "phase": 2}, "zt-7.3": {"id": "7.3", "name": "Common Security and Risk Analytics", "description": "The Common Security and Risk Analytics Capability integrates analysis across multiple data types to examine events, activities, and behaviors. Cybersecurity Service Providers (CSSPs) and SOCs employ data tools across their environments to identify multiple data types to unify data collection and examine events, activities, and behaviors.", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.3.1": {"id": "7.3.1", "name": "Implement Analytics Tools", "description": "DoD Components procure and implement basic cyber-focused analytics tools. Analytics development is prioritized based on risk and complexity, focusing first on easy impactful analytics. Continued analytics development focuses on Pillar requirements to better meet reporting needs.", "predecessor": ["7.1.2"], "successor": [], "outcomes": ["Develop requirements for analytic environment", "Procure and implement analytic tools"], "m": 12.1, "phase": 1}, "zt-7.3.2": {"id": "7.3.2", "name": "Establish User Baseline Behavior", "description": "Using the analytics developed for users and devices in a separate activity, activity baselines are integrated into technical solutions. These baselines are applied to an identified set of users initially based on risk and later expanded to the larger DoD user base. The technical solution used is integrated with machine learning functionality to begin automation.", "predecessor": ["1.6.1", "7.1.3"], "successor": [], "outcomes": ["Identify users for baseline", "Establish machine learning (ML) based baselines"], "m": 13.8, "phase": 2}, "zt-7.4": {"id": "7.4", "name": "User and Entity Behavior Analytics", "description": "The User and Entity Behavior Analytics Capability uses advanced analytics to support detection of anomalous user, device, and NPE actions and advanced threats. DoD Components initially employ analytics to profile and baseline activity of users and entities. The Components also correlate user activities and behaviors to detect anomalies. CSSPs or SOCs mature this capability through the employment of advanced analytics to expand their ability to detect anomalies.", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.4.1": {"id": "7.4.1", "name": "Baseline & Profiling Part 1", "description": "Using the analytics developed for users and devices in a separate activity, common profiles are created for typical user and device types. Analytics taken from baselining are updated to look at larger containers, or profiles.", "predecessor": ["1.6.1", "7.1.3"], "successor": ["7.4.2"], "outcomes": ["Develop analytics to detect changing threat conditions", "Identify user and device threat profiles"], "m": 12.3, "phase": 2}, "zt-7.4.2": {"id": "7.4.2", "name": "Baseline & Profiling Part 2", "description": "DoD Components expand baselines and profiles to include unmanaged and non-standard device types including IoT and OT. These devices are profiled based on standardized attributes and use cases. Analytics are updated to consider new baselines and profiles, enabling further detections and response. Specific risky users and devices are automatically prioritized for increased monitoring based on risk. Detection and response are integrated with cross pillar functionalities.", "predecessor": ["4.4.6", "7.4.1"], "successor": ["7.4.4"], "outcomes": ["Add threat profiles for Internet of Things (IoT) and Operational Technology (OT) devices", "Develop and extend analytics", "Extend threat profiles to individual users and devices"], "m": 22.7, "phase": 3}, "zt-7.4.3": {"id": "7.4.3", "name": "UEBA Baseline Support Part 1", "description": "Within DoD Components UEBA expands monitoring to advanced analytics such as Machine Learning (ML). These results are in turn reviewed and fed back into the ML algorithms to improve detection and response.", "predecessor": [], "successor": ["7.6.1", "7.4.4"], "outcomes": ["Implement ML-based analytics to detect anomalies"], "m": 6.3, "phase": 3}, "zt-7.4.4": {"id": "7.4.4", "name": "UEBA Baseline Support Part 2", "description": "Within DoD Components UEBA completes its expansion by using traditional and ML results to be fed into AI algorithms. Initially AI based detections are supervised but ultimately using advanced techniques such as neural networks, UEBA operators are not part of the learning process.", "predecessor": ["7.4.2", "7.4.3"], "successor": [], "outcomes": ["Implement AI-based analytics to detect anomalies initially supervised and then unsupervised"], "m": 6.3, "phase": 4}, "zt-7.5": {"id": "7.5", "name": "Threat Intelligence Integration", "description": "The Threat Intelligence Integration Capability enhances monitoring efforts and incident response by integrating threat intelligence with other applicable security technology (e.g., SIEM, EDR, XDR). CSSPs or SOCs integrate threat intelligence information and data streams about identities, motivations, characteristics, and TTPs with data collected in the SIEM. A formalized CTI program is established sourcing both open and closed threat feeds which are integrated into security technologies. As the capability matures, an official public disclosure program is established to handle reported vulnerabilities and threats.", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.5.1": {"id": "7.5.1", "name": "Cyber Threat Intelligence Program Part 1", "description": "The DoD Enterprise works with the Components to develop a CTI program policy, standards, and processes. Organizations use this documentation to develop organizational CTI teams with key mission/task stakeholders. CTI teams integrate common feeds of data with the SIEM for improved alerting and response. Integration with device and network enforcement points (e.g., firewalls, endpoint security suites, etc.) are created to conduct basic monitoring of CTI driven data.", "predecessor": [], "successor": ["7.2.2", "7.5.2"], "outcomes": ["CTI team is in place with critical stakeholders", "Public and baseline CTI feeds are being utilized by SIEM for alerting", "Basic integration points exist with device and network enforcement points (e.g.,Next Generation Anti-Virus (NGAV), Next Generation Firewall (NGFW), NextGeneration Intrusion Protection (NG-IPS), etc.)"], "m": 9.94, "phase": 1}, "zt-7.5.2": {"id": "7.5.2", "name": "Cyber Threat Intelligence Program Part 2", "description": "DoD Components expand their CTI teams to include new stakeholders as appropriate. Authenticated, private and controlled CTI data feeds are integrated into SIEM and enforcement points implemented for the Device, User, Network and Data pillars.", "predecessor": ["7.5.1"], "successor": [], "outcomes": ["CTI team is in place with extended stakeholders as appropriate", "Controlled and private feed are being utilized by SIEM and other appropriateAnalytics tools for alerting and monitoring", "Integration is in place for extended enforcement points within the Device, User,Network and Data Pillars (UEBA, UAM, etc.)"], "m": 19.5, "phase": 2}, "zt-7.6": {"id": "7.6", "name": "Automated Dynamic Policies", "description": "The Automated Dynamic Policies Capability denies access to users and NPEs using automated, real-time security profiles based on external conditions and evolving risk and confidence scores driven by ML and AI. DoD Components use their ML and AI solutions to update security profiles and device configuration dynamically and automatically through continuous security posture monitoring, risk and confidence scoring, and automated patch management.", "predecessor": [], "successor": [], "outcomes": []}, "zt-7.6.1": {"id": "7.6.1", "name": "AI-enabled Network Access", "description": "DoD Components use the SDN infrastructure and enterprise security profiles to enable AI and ML driven network access. Analytics from previous activities are used to teach the AI and ML algorithms, improving decision making.", "predecessor": ["1.8.2", "1.2.2", "7.4.3"], "successor": ["5.2.5", "7.6.2"], "outcomes": ["Network access is AI driven based on environment analytics"], "m": 27.8, "phase": 3}, "zt-7.6.2": {"id": "7.6.2", "name": "AI-enabled Dynamic Access Control", "description": "DoD Components use previous rule based dynamic access to teach AI/ML algorithms to make access decisions for various resources. Activity 7.6.1, AI-enabled Network Access [Visibility & Analytics Pillar, Automated Dynamic Policies Capability], updates the activity algorithms to enable broader decision making for access to all DAAS.", "predecessor": ["1.8.4", "6.1.4", "7.6.1"], "successor": [], "outcomes": ["JIT/JEA are integrated with AI", "Access is AI driven based on environment analytics"], "m": 24.4, "phase": 4}}, "phaseOrder": {"0": ["1.1.1", "2.1.1", "2.3.4", "3.1.1", "4.1.1", "4.4.1", "4.4.2", "5.1.1", "5.2.1", "6.1.1", "6.2.1", "6.5.1", "6.6.1", "7.1.1"], "2": ["1.2.1", "1.2.2", "1.4.2", "1.5.2", "1.6.1", "1.8.2", "1.9.1", "2.1.3", "2.2.1", "2.3.3", "2.4.2", "2.6.3", "2.7.2", "3.2.2", "3.3.3", "3.3.4", "3.4.2", "3.4.7", "4.2.3", "4.3.2", "4.4.4", "4.5.2", "4.5.3", "4.6.2", "4.7.1", "4.7.4", "5.2.3", "5.3.2", "5.4.2", "5.4.4", "6.1.3", "6.2.2", "6.3.1", "6.6.3", "6.7.2", "7.1.3", "7.2.2", "7.2.5", "7.3.2", "7.4.1", "7.5.2"], "3": ["1.2.3", "1.2.4", "1.3.2", "1.4.3", "1.5.3", "1.6.2", "1.8.3", "1.9.2", "2.1.4", "2.2.2", "2.3.1", "2.3.5", "2.3.6", "2.4.3", "2.7.3", "3.2.3", "3.4.3", "3.5.1", "4.3.3", "4.3.4", "4.4.5", "4.5.4", "4.6.3", "4.7.2", "4.7.5", "4.7.6", "5.2.4", "5.2.5", "5.4.3", "6.1.4", "6.2.3", "6.4.1", "6.7.3", "7.2.3", "7.4.2", "7.4.3", "7.6.1"], "4": ["1.2.5", "1.3.3", "1.4.4", "1.5.4", "1.6.3", "1.8.4", "1.9.3", "2.3.2", "2.3.7", "2.4.4", "3.2.4", "3.4.4", "3.4.5", "3.5.2", "4.3.5", "4.4.6", "4.5.5", "4.6.4", "4.7.3", "4.7.7", "6.4.2", "6.5.3", "6.7.4", "7.4.4", "7.6.2"], "1": ["1.3.1", "1.4.1", "1.5.1", "1.7.1", "1.8.1", "2.1.2", "2.4.1", "2.5.1", "2.6.1", "2.6.2", "2.7.1", "3.2.1", "3.3.1", "3.3.2", "3.4.1", "3.4.6", "4.2.1", "4.2.2", "4.3.1", "4.4.3", "4.5.1", "4.6.1", "5.1.2", "5.2.2", "5.3.1", "5.4.1", "6.1.2", "6.5.2", "6.6.2", "6.7.1", "7.1.2", "7.2.1", "7.2.4", "7.3.1", "7.5.1"]}}